<template>
  <div>
    <h2>电脑解卦{{ guaType }}</h2>
    <div v-if='guaType == 9'>
      <ul>
        <li v-if='guaData["guanEqShi"]'>官星持世或动而生合世爻，多智多谋，名声远扬。</li>
        <li>官星持世不动遇克，凡事无成。</li>
        <li>日月临官或生合世爻，测官有官</li>
        <li>太岁临旺官持世，定得佐官之职。</li>
        <li>官动生世扶世，必有进取之心。</li>
        <li>岁五生合世爻，必平步青云。</li>
        <li>日月临五爻官鬼，有越级之喜。</li>
        <li>官动合世，日月扶之有人推荐。</li>
        <li>虎临旺官持世，贵人武职。</li>
        <li>官临子午卯酉为正职，寅申巳亥为副职，辰戌丑未为杂官，临日月者掌印，旺者官大，衰者官小。</li>
        <li>世旺化官星来刑克，反受官名之害。</li>
        <li>官动而刑克世爻，必有凶灾。</li>
        <li>太岁入官动而伤世，必有降级之灾，如遇虎蛇刑害，有牢狱之灾。</li>
        <li>五爻官临日月伤世，急急避之。</li>
        <li>官星遇凶遭克，世又遇克，今日得官明日亡。</li>
        <li>世官空破，一生无成，世官入库，如醉如痴。</li>
        <li>鬼伏世下，必遭责罚。</li>
        <li>世在五爻空，若日月刑克，祸患莫测。</li>
        <li>世临无救之空必有大难。</li>
        <li>父临太岁生合世爻，主越级升官，如临日辰，上司奖励。</li>
        <li>两父两官，两处任职，或两处都要。</li>
        <li>父旺，工作单位大，休囚则单位小，不称意，受克则单位不兴旺。</li>
        <li>官星持世财动相生，测官有官，考工录用。</li>
        <li>财官两旺，世衰者得官无福，世官两旺，财衰者，工资不高。</li>
        <li>世旺财旺或财动生世，立功建业。</li>
        <li>官旺兄兴两袖清风。</li>
        <li>兄弟发动招诽谤防减薪，如子孙同动必减薪。</li>
        <li>子孙持世或临日月动而克世克官，求官无官有官必剥。</li>
        <li>财爻持世化兄，凡事无成，或无食禄。</li>
        <li>卦逢六冲有始无终，填逢六合基业开拓。</li>
      </ul>
    </div>
  </div>
</template>
<script>
export default {
  name: 'jieGua',
  props: {
    guaType: String,
    guaData: Object,
  }
}
</script>
