<template>
  <div class='wrap' >
    <div :class="{ disabled: !isDisplay && (guaOrder != 63)  }">
      <h2>乾为天 乾上乾下</h2>
      <div class='guaci'>乾: 元, 亨, 利, 贞. </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 潜龙, 勿用. </li>
          <li>九二: 见龙在田, 利见大人. </li>
          <li>九三: 君子终日乾乾, 夕惕若, 厉, 无咎. </li>
          <li>九四: 或跃在渊, 无咎. </li>
          <li>九五: 飞龙在天, 利见大人. </li>
          <li>上九: 亢龙有悔. </li>
          <li>用九: 见群龙无首, 吉. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 大哉乾元, 万物资始, 乃统天. 云行雨施, 品物流形. 大明终始,  六位时成, 时乘六龙以御天. 乾道变化, 各正性命, 保合大和, 乃 利贞. 首出庶物, 万国咸宁. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 天行健, 君子以自强不息.  潜龙勿用, 阳在下也.  见龙再田, 德施普也.  终日乾乾, 反复道 也. 或跃在渊, 进无咎也. 飞龙在天, 大人造也.  亢龙有悔, 盈 不可久也.  用九, 天德不可为首也. 
      </div>
      <h3>卦辞(文王)</h3>
      <div class='wenyan'>
        文言曰: 「元者, 善之长也, 亨者, 嘉之会也, 利者, 义之和也, 贞者,  事之干也.  君子体仁, 足以长人；嘉会, 足以合礼；利物, 足以 和义；贞固, 足以干事.  君子行此四者, 故曰: 乾: 元亨利贞. 」
        <ul>
          <li>"潜龙勿用", 阳气潜藏；"见龙在田", 天下文明；"终日乾乾", 与时偕行；"或跃在渊", 乾道乃革；"飞龙在天", 乃位乎天德；"亢龙有悔", 与时偕极；乾元"用九", 乃见天则. </li>
          <li>乾"元"者, 始而亨者也；"利贞"者, 性情也. 乾始能以美利利天下, 不言所利, 大矣哉, 大哉乾乎, 刚健中正, 纯粹精也. 六爻发挥, 旁通情也, 时乘六龙, 以御天也. 云行雨施, 天下平也. </li>
          <li>君子以成德为行, 日可见之行也. "潜"之为言也, 隐而未见, 行而未成, 是以君子弗用也. 君子学以聚之, 问以辩之, 宽以居之, 仁以行之. 《易》曰: "见龙在田, 利见大人. "君德也. 九三重刚而不中, 上不在天, 下不在田, 故乾乾因其时而惕, 虽危"无咎"矣. 九四重刚而不中, 上不在天, 下不在田, 中不在人, 故"或"之, 或之者, 疑之也. 故"无咎". 夫"大人"者, 与天地合其德, 与日月合其明, 与四时合其序, 与鬼神合其吉凶. 先天而天弗违, 后天而奉天时, 天且弗违, 而况于人乎！况于鬼神乎！"亢"之为言也, 知进而不知退, 知存而不知亡, 知得而不知丧, 其唯圣人乎！知进退存亡而不失其正者, 其唯圣人乎！</li>
        </ul>
      </div>
      <h3>易传(孔子)</h3>
      <div class='kongzi'>
        <ul>
          <li class='cite'>初九 「潜龙勿用. 」 何谓也？</li>
          <li>子曰: 「龙德而隐者也. 不易乎世, 不成乎名；遁世无闷, 不见是而无闷；乐则行之, 忧则违之；确乎其不可拔, 潜龙也. 」</li>
          <li class='cite'>九二 「见龙在田, 利见大人. 」 何谓也？</li>
          <li>子曰: 「龙德而正中者也.  庸言之信, 庸行之谨, 闲邪存其诚, 善世而不伐, 德博而化.  易曰: 「见龙在田, 利见大人. 」 君德也. 」</li>
          <li class='cite'>九三 「君子终日乾乾, 无咎. 」 何谓也？</li>
          <li>子曰: 「君子进德修业, 忠信, 所以进德也. 修辞立其诚, 所以居业也. 知至至之, 可与几也.  知终终之, 可与存义也.  是故, 居上位而不骄, 在下位而不忧. 故乾乾, 因其时而惕, 虽危无咎矣. 」</li>
          <li class='cite'>九四 「或跃在渊, 无咎. 」 何谓也？</li>
          <li>子曰: 「上下无常, 非为邪也.  进退无恒, 非离群也.  君子进德修业, 欲及时也, 故无咎. 」</li>
          <li class='cite'>九五 「飞龙在天, 利见大人. 」 何谓也？</li>
          <li>子曰: 「同声相应, 同气相求；水流湿, 火就燥；云从龙, 风从虎.  圣人作, 而万物睹, 本乎天者亲上, 本乎地者亲下, 则各从其类也. </li>
          <li class='cite'>上九 「亢龙有悔. 」 何谓也？</li>
          <li>子曰: 「贵而无位, 高而无民, 贤人在下而无辅, 是以动而有悔也. 」</li>
        </ul>
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 困龙得水好运交, 不由喜气上眉梢, 一切谋望皆如意, 向后时运渐渐高. <br>
            这个卦是同卦（下乾上乾）相叠. 象征天, 喻龙（德才的君子）, 又象征纯粹的阳和健, 表明兴盛强健. 乾卦是根据万物变通的道理, 以"元、亨、利、贞"为卦辞, 示吉祥如意, 教导人遵守天道的德行. </li>
          <li>事业: 大吉大利, 万事如意, 心想事成, 自有天佑, 春风得意, 事业如日中天. 但阳气已达顶点, 盛极必衰, 务须提高警惕, 小心谨慎. 力戒骄傲, 冷静处世, 心境平和, 如是则能充分发挥才智, 保证事业成功. </li>
          <li>经商: 十分顺利, 有发展向上的大好机会. 但切勿操之过急, 宜冷静分析形势, 把握时机, 坚持商业道德, 冷静对待中途出现的困难, 定会有满意的结果. </li>
          <li>求名: 潜在能力尚未充分发挥, 只要进一步努力, 克服骄傲自满情绪, 进业修德, 以渊博学识和高尚品质, 成君子之名. </li>
          <li>外出: 利于出行, 结伴而行更佳. </li>
          <li>婚恋: 阳盛阴衰, 但刚柔可相济, 形成美满结果. 女性温柔者更佳. </li>
          <li>决策: 可成就大的事业. 坚持此卦的刚健、正直、公允的实质, 修养德行, 积累知识, 坚定信念, 自强不息, 必能克服困难, 消除灾难. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 0)  }">
      <h2>坤为地 坤上坤下</h2>
      <div class='guaci'>坤: 元, 亨, 利牝马之贞.  君子有攸往, 先迷后得主, 利；西南得朋, 东北丧朋.  安贞, 吉. </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 履霜, 坚冰至. </li>
          <li>六二: 直, 方, 大, 不习无不利. </li>
          <li>六三: 含章可贞.  或从王事, 无成有终. </li>
          <li>六四: 括囊；无咎, 无誉. </li>
          <li>六五: 黄裳, 元吉. </li>
          <li>上六: 龙战于野, 其血玄黄. </li>
          <li>用六: 利永贞. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 至哉坤元, 万物资生, 乃顺承天.  坤厚载物, 德合无疆.  含弘光 大, 品物咸亨.  牝马地类, 行地无疆, 柔顺利贞.  君子攸行, 先 迷失道, 后顺得常.  西南得朋, 乃与类行；东北丧朋, 乃终有庆.  安贞之吉, 应地无疆. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 地势坤, 君子以厚德载物. 履霜坚冰, 阴始凝也.  驯致其道, 至坚冰也. 六二之动, 直以方也.  不习无不利, 地道光也. 含章可贞；以时发也.  或从王事, 知光大也. 括囊无咎, 慎不害也. 黄裳元吉, 文在中也. 龙战于野, 其道穷也. 用六永贞, 以大终也. 
      </div>
      <h3>卦辞(文王)</h3>
      <div class='wenyan'>
        文言曰: 坤至柔, 而动也刚, 至静而德方, 后得主而有常, 含万物而化光.  坤道其顺乎？ 承天而时行. 
        积善之家, 必有余庆；积不善之家, 必有余殃.  臣弑其君, 子 弑其父, 非一朝一夕之故, 其所由来者渐矣, 由辩之不早辩也.  易 曰: 「履霜坚冰至. 」 盖言顺也. 
        直其正也, 方其义也.  君子敬以直内, 义以方外, 敬义立, 而 德不孤.  「直, 方, 大, 不习无不利」；则不疑其所行也. 
        阴虽有美, 含之；以从王事, 弗敢成也.  地道也, 妻道也, 臣 道也.  地道无成, 而代有终也. 
        天地变化, 草木蕃； 天地闭, 贤人隐.  易曰: 「括囊；无咎,  无誉. 」 盖言谨也. 
        君子黄中通理, 正位居体, 美在其中, 而畅于四支, 发于事业,  美之至也. 
        阴疑于阳, 必战. 为其嫌于无阳也, 故称龙焉. 犹未离其类也,  故称血焉.  夫玄黄者, 天地之杂也, 天玄而地黄. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 肥羊失群入山岗, 饿虎逢之把口张, 适口充肠心欢喜, 卦若占之大吉昌. </li>
          <li>这个卦是同卦（下坤上坤）相叠, 阴性. 象征地（与乾卦相反）, 顺从天. 承载万物, 伸展无穷无尽. 坤卦以雌马为象征, 表明地道生育抚养万物, 而又依天顺时, 性情温顺. 它以"先迷后得"证明"坤"顺从"乾", 依随"乾", 才能把握正确方向, 遵循正道, 获取吉利. </li>
          <li>事业: 诸项事业可以成功, 得到预想的结果, 但开始出师不利, 为困境所扰. 切莫冒险急进, 须小心谨言慎行, 尤其不可单枪匹马, 独断专行. 取得朋友的关心和支持最为重要, 在他人的合作下, 共同完成事业. 因此, 应注重内心修养, 积蓄养德, 效法大地, 容忍负重, 宽厚大度, 以直率、方正、含蓄为原则, 不得贪功自傲, 持之以恒, 谋求事业的成功. </li>
          <li>经商: 机遇不很好, 切莫冒险, 以稳健为妥, 遇到挫折, 务必即时总结经验. 注意储存货物, 待价而沽, 处处小心为是. </li>
          <li>求名: 比较顺利, 具备基本条件, 踏踏实实, 埋头苦干, 不追求身外之物, 即可吉祥. </li>
          <li>外出: 宜结伴而行. 可去陌生的地方. </li>
          <li>婚恋: 阴盛. 以柔克刚, 女方柔顺, 美好姻缘, 白头到老. </li>
          <li>决策: 忠厚、温和, 待人真诚, 热心助人, 因此也能得到他人的帮助, 可往往因不提防小人而受到伤害, 但无大碍. 性格灵活, 工作方法多样, 可以左右逢源, 得到赞许. 难, 消除灾难. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 34)  }">
      <h2>水雷屯(zhūn) 坎上震下</h2>
      <div class='guaci'>
        屯: 元, 亨, 利, 贞, 勿用, 有攸往, 利建侯. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 磐桓；利居贞, 利建侯. 
          </li>
          <li>六二: 屯如邅如, 乘马班如.  匪寇婚媾, 女子贞不字, 十年乃字. 
          </li>
          <li>六三: 既鹿无虞, 惟入于林中, 君子几不如舍, 往吝. 
          </li>
          <li>六四: 乘马班如, 求婚媾, 往吉, 无不利. 
          </li>
          <li>九五: 屯其膏, 小贞吉, 大贞凶. 
          </li>
          <li>上六: 乘马班如, 泣血涟如. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 屯, 刚柔始交而难生, 动乎险中, 大亨贞. 雷雨之动满盈, 天造草昧, 宜建侯而不宁. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 云, 雷, 屯；君子以经纶. 
        虽磐桓, 志行正也.  以贵下贱, 大得民也. 
        六二之难, 乘刚也.  十年乃字, 反常也. 
        既鹿无虞, 以从禽也.  君子舍之, 往吝穷也. 
        求而往, 明也. 
        屯其膏, 施未光也. 
        泣血涟如, 何可长也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 风刮乱丝不见头, 颠三倒四犯忧愁, 慢从款来左顺遂, 急促反惹不自由. </li>
          <li>这个卦是异卦（下震上坎）相叠, 震为雷, 喻动；坎为雨, 喻险. 雷雨交加, 险象丛生, 环境恶劣. "屯"原指植物萌生大地. 万物始生, 充满艰难险阻, 然而顺时应运, 必欣欣向荣. </li>
          <li>事业: 起初多不利, 必知难而进, 小心翼翼, 勇往直前, 灵活机动, 可望获得大的成功, 时机到来时一定要抓住, 却也不得操之太急, 且仍有困难, 务必有他人相助, 故平时应多施恩惠. </li>
          <li>经商: 创业初期步履艰难, 多有挫折. 坚定信念最重要, 不要为表面现象所迷惑, 应积极进取, 行动果断, 打开出路. 若仍无法摆脱困境, 则应退守保全, 等待机会, 再展宏图. </li>
          <li>求名: 积极争取, 主动追求, 可以成功. </li>
          <li>外出: 慎重为好, 有危险, 宜改日动身. </li>
          <li>婚恋: 好事多磨, 忠贞纯洁, 大胆追求, 能够成功, 婚姻美满. </li>
          <li>决策: 初始困难, 但若具有坚忍不拔的毅力和锲而不舍的奋斗精神, 前途不可估量, 但往往不为他人理解而陷于孤独苦闷, 事业会因此处于困难状态, 需要得到贤德之人的帮助才能摆脱. 如能以乐观主义精神处世, 能取得成就. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 17)  }">
      <h2>山水蒙 艮上坎下</h2>
      <div class='guaci'>
        蒙: 亨.  匪我求童蒙, 童蒙求我.  初噬告, 再三渎, 渎则不告. 利贞. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 发蒙, 利用刑人, 用说桎梏, 以往吝. 
          </li>
          <li>九二: 包蒙吉；纳妇吉；子克家. 
          </li>
          <li>六三: 勿用娶女；见金夫, 不有躬, 无攸利. 
          </li>
          <li>六四: 困蒙, 吝. 
          </li>
          <li>六五: 童蒙, 吉. 
          </li>
          <li>上九: 击蒙；不利为寇, 利御寇. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 蒙, 山下有险, 险而止, 蒙.  蒙亨, 以亨行时中也. 匪我求童蒙, 
        童蒙求我, 志应也.  初噬告, 以刚中也. 再三渎,  渎则不告, 渎
        蒙也.  蒙以养正, 圣功也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 山下出泉, 蒙；君子以果行育德. 
        利用刑人, 以正法也. 
        子克家, 刚柔节(节=接)也. 
        勿用娶女, 行不顺也. 
        困蒙之吝, 独远实也. 
        童蒙之吉, 顺以巽(巽=逊)也. 
        利用御寇, 上下顺也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 卦中爻象犯小耗, 君子占之运不高, 婚姻合伙有琐碎, 做事必然受苦劳. </li>
          <li>这个卦是异卦（下坎上艮）相叠, 艮是山的形象, 喻止；坎是水的形象, 喻险. 卦形为山下有险, 仍不停止前进, 是为蒙昧, 故称蒙卦. 但因把握时机, 行动切合时宜, 因此, 具有启蒙和通达的卦象. </li>
          <li>事业: 事业开始, 混乱无序, 危机四伏, 以勇敢坚毅的行动可以扭转局面. 然而必须接受严格教育, 培养这种奋发图强的精神. 务必脚踏实地, 最忌好高骛远, 否则会陷入孤立无援的境地. </li>
          <li>经商: 务必小心谨慎, 不得急功近利, 尤其应树立高尚的商业道德, 以良好的信誉提高竞争力而取胜. </li>
          <li>求名: 必须接受良好的基础教育, 陶冶情操. 且动机纯正, 可以达到目的. </li>
          <li>外出: 等候有利时机再行动, 等待期间应积极做准备. </li>
          <li>婚恋: 注意考察对方品德, 不可以金钱为诱铒. 夫妻需相互宽容、理解. </li>
          <li>决策: 有时会陷入迷惘困顿的境地, 加上胆小、不果断, 往往误事. 如能接受长辈的教诲, 甚至严酷的考验, 抛弃疑惧的心理, 等待适当时机, 必然一帆风顺. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 58)  }">
      <h2>水天需 坎上乾下</h2>
      <div class='guaci'>
        需: 有孚, 光亨, 贞吉.  利涉大川. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 需于郊.  利用恒, 无咎. 
          </li>
          <li>九二: 需于沙.  小有言, 终吉. 
          </li>
          <li>九三: 需于泥, 致寇至. 
          </li>
          <li>六四: 需于血, 出自穴. 
          </li>
          <li>九五: 需于酒食, 贞吉. 
          </li>
          <li>上六: 入于穴, 有不速之客三人来, 敬之终吉. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 需, 须也；险在前也.  刚健而不陷, 其义不困穷矣.  需有孚, 光
        亨, 贞吉.  位乎天位, 以正中也.  利涉大川, 往有功也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 云上于天, 需；君子以饮食宴乐. 
        需于郊, 不犯难行也.  利用恒, 无咎；未失常也. 
        需于沙, 衍在中也.  虽小有言, 以吉终也. 
        需于泥, 灾在外也.  自我致寇, 敬慎不败也. 
        需于血, 顺以听也. 
        酒食贞吉, 以中正也. 
        不速之客来, 敬之终吉.  虽不当位, 未大失也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 明珠土埋日久深, 无光无亮到如今, 忽然大风吹土去, 自然显露有重新. </li>
          <li>这个卦是异卦（下乾上坎）相叠, 下卦是乾, 刚健之意；上卦是坎, 险陷之意. 以刚逢险, 宜稳健之妥, 不可冒失行动, 观时待变, 所往一定成功. </li>
          <li>事业: 关键在于审时度势, 耐心等待, 事成于安祥, 切勿冒险, 欲速不达. 自己要充满自信, 临危不惧, 坚守中正, 必可化险为夷. 情况有利时, 仍得居安思危. </li>
          <li>经商: 行动之初, 情况困难, 必须以极大的耐心, 创造条件和机会, 行事光明磊落, 观时待变, 实现愿望. 事情接近成功时, 更应小心谨慎, 切莫功亏一篑. </li>
          <li>求名: 时机尚不成熟, 应耐心等待. 这时应坚定信念, 不为闲言流语所动摇, 努力丰富自己, 再求助可靠的人便可成功. </li>
          <li>外出: 充分准备齐全后, 可平安无事. </li>
          <li>婚恋: 慎重, 切不可草率行事, 逐渐培养感情, 以诚实、热情相待, 会发生变故, 仍可以有良好的结局. 双方都应懂得以柔克刚的道理. </li>
          <li>决策: 前途光明, 有雄心大志, 且可实现. 为此需要积蓄实力, 等待时机, 大器晚成. 本人具有坚强的意志, 冷静静的头脑. 前进途中会遇到困难和险阻, 必须十分谨慎, 坦然对待小人的中伤, 在灾祸在面前能镇静自若. 不轻举妄动, 冷静选择方向. 为人谦和、坦率, 多有他人相助, 促使事业成功. 当时机, 必然一帆风顺. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 23)  }">
      <h2>天水讼 乾上坎下</h2>
      <div class='guaci'>
        讼: 有孚, 窒惕, 中吉. 终凶. 利见大人, 不利涉大川. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 不永所事, 小有言, 终吉. 
          </li>
          <li>九二: 不克讼, 归而逋其邑, 人三百户, 无眚. 
          </li>
          <li>六三: 食旧德, 贞厉, 终吉, 或从王事, 无成. 
          </li>
          <li>九四: 不克讼, 复自命, 渝, 安贞, 吉. 
          </li>
          <li>九五: 讼元吉. 
          </li>
          <li>上九: 或锡之鞶带, 终朝三褫之. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 讼, 上刚下险, 险而健, 讼. 讼有孚, 窒惕中吉, 刚来而得中也. 终
        凶；讼不可成也.  利见大人；尚中正也. 不利涉大川；入于渊也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 天与水违行, 讼；君子以作事谋始. 
        不永所事, 讼不可长也.  虽有小言, 其辩明也. 
        不克讼, 归而逋归逋窜也.  自下讼上, 患至掇也. 
        食旧德, 从上吉也. 
        复即命渝, 安贞；不失也. 
        讼元吉, 以中正也. 
        以讼受服, 亦不足敬也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 心中有事事难做, 恰是二人争路走, 雨下俱是要占先, 谁肯让谁走一步. </li>
          <li>这个卦是异卦（下坎上乾）相叠. 同需卦相反, 互为"综卦". 乾为刚健, 坎为险陷. 刚与险, 健与险, 彼此反对, 定生争讼. 争讼非善事, 务必慎重戒惧. </li>
          <li>事业: 起初顺利, 有利可图, 继而受挫, 务必警惕, 慎之又慎, 不得固执已见, 极力避免介入诉讼纠纷的争执之中. 与其这样, 不如退而让人, 求得化解, 安于正理, 可免除意外之灾. 陷入争讼, 即使获胜, 最后还得失去, 得不偿失. </li>
          <li>经商: 和气生财, 吃亏是福. 切勿追求不义之财. 商业谈判坚持公正公平、互利的原则, 尽量避免发生冲突. 这样, 会有好结果. </li>
          <li>求名: 不利. 自己尚缺乏竞争实力, 应坚守纯正, 隐忍自励, 自强自勉, 切莫逞强. 依靠有地位的人的帮助, 及早渡过难关. </li>
          <li>外出: 途中多有变故, 宜改日出行. </li>
          <li>婚恋: 虽不尽人意, 倒也般配, 彼此理解, 未尝不可. 双方应以温和的方式处理生活. </li>
          <li>决策: 争强好胜, 不安于现状, 为改变命运和超越他人而奋斗. 头脑聪颖, 反应敏捷, 有贵人相助. 但缺乏持之以恒的毅力, 容易露出锋芒, 得罪他人, 带来诉讼之灾. 宜承认现实, 顺其自然, 知足, 适可而止. 接受教训, 引以为戒, 可功成名就. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 16)  }">
      <h2>地水师 坤上坎下</h2>
      <div class='guaci'>
        师: 贞, 丈人吉, 无咎. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 师出以律, 否臧凶. 
          </li>
          <li>九二: 在师中, 吉无咎, 王三锡命. 
          </li>
          <li>六三: 师或舆尸, 凶. 
          </li>
          <li>六四: 师左次, 无咎. 
          </li>
          <li>六五: 田有禽, 利执言, 无咎. 长子帅师, 弟子舆尸, 贞凶. 
          </li>
          <li>上六: 大君有命, 开国承家, 小人勿用. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 师, 众也, 贞正也, 能以众正, 可以王矣.  刚中而应, 行险而顺, 
        以此毒天下, 而民从之, 吉又何咎矣. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 地中有水, 师；君子以容民畜众. 
        师出以律, 失律凶也.  
        在师中吉, 承天宠也.  王三锡命, 怀万邦也. 
        师或舆尸, 大无功也. 
        左次无咎, 未失常也. 
        长子帅师, 以中行也. 弟子舆尸, 使不当也. 
        大君有命, 以正功也.  小人勿用, 必乱邦也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 将帅领旨去出征, 骑着烈马拉硬弓, 百步穿杨去得准, 箭中金钱喜气生. </li>
          <li>这个卦是异卦（下坎上坤）相叠. "师"指军队. 坎为水、为险；坤为地、为顺, 喻寓兵于农. 兵凶战危, 用兵乃圣人不得已而为之, 但它可以顺利无阻碍地解决矛盾, 因为顺乎形势, 师出有名, 故能化凶为吉. </li>
          <li>事业: 阻力很大, 困难很多, 处于激烈的竞争状态, 必与他人密切合作, 谨小慎微, 行为果断, 切忌盲目妄动, 适度即可, 注意保全自己. 机动灵活, 严于律已. 从容沉着对付一切, 必能成功. </li>
          <li>经商: 已有一定的积蓄, 可以从事大的营销活动, 但必卷入激烈商战, 以刚毅顽强的精神和高尚的商业道德, 辅以灵活的方法, 勿贪图小利, 勿掉以轻心, 加强与他人的沟通, 必可摆脱困境, 化险为夷. </li>
          <li>求名: 具备很好的条件, 但须有正确的引导, 务必严格要求自己, 克服不利因素的干扰, 经过扎实努力, 必可名利双全. </li>
          <li>外出: "行险而顺. "虽有可能遇到麻烦, 但结果一定十分顺利, 可放心出行. </li>
          <li>婚恋: 慎重、专注, 否则会陷入"三角"纠纷. 痴情追求可以达到目的. </li>
          <li>决策: 天资聪颖, 性格灵活, 具有坚强的意志, 对事业执着追求, 迎难而进. 可成就大事业. 喜竞争, 善争辩, 富有冒险精神, 不免带来麻烦, 务老成持重, 不贪功, 以中正为要. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 2)  }">
      <h2>水地比 坎上坤下</h2>
      <div class='guaci'>
        比: 吉.  原筮元永贞, 无咎.  不宁方来, 后夫凶. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 有孚比之, 无咎.  有孚盈缶, 终来有它, 吉. 
          </li>
          <li>六二: 比之自内, 贞吉. 
          </li>
          <li>六三: 比之匪人. 
          </li>
          <li>六四: 外比之, 贞吉. 
          </li>
          <li>九五: 显比, 王用三驱, 失前禽.  邑人不诫, 吉. 
          </li>
          <li>上六: 比之无首, 凶. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 比, 吉也, 比, 辅也, 下顺从也.  原筮元永贞, 无咎, 以刚中也. 
        不宁方来, 上下应也.  后夫凶, 其道穷也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 地上有水, 比；先王以建万国, 亲诸侯. 
        比之初六, 有它吉也. 
        比之自内, 不自失也. 
        比之匪人, 不亦伤乎！
        外比於贤, 以从上也. 
        显比之吉, 位正中也. 舍逆取顺, 失前禽也.  邑人不诫, 上使中也. 
        比之无首, 无所终也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 顺风行船撒起帆, 上天又助一蓬风, 不用费力逍遥去, 任意而行大亨通. </li>
          <li>这个卦是异卦（下坤上坎）相叠, 坤为地；坎为水. 水附大地, 地纳河海, 相互依赖, 亲密无间. 此卦与师卦完全相反, 互为综卦. 它阐述的是相亲相辅, 宽宏无私, 精诚团结的道理. </li>
          <li>事业: 顺利能够成功, 向前发展, 可以得到他人的帮助和辅佐, 以诚实、信任的态度去做事. 待人宽厚、正直, 主动热情, 向才德高尚的人士学习, 听取建议. </li>
          <li>经商: 愿望能够实现, 且有较丰厚的利润, 但需要与他人密切合作, 真诚交往, 讲究商业道德, 遵守信义, 如唯利是图, 贪心不足, 或自以为是, 会导致严重损失. </li>
          <li>求名: 有成功的希望, 不仅要靠个人的努力, 更为重要的是他人的赏识和栽培. </li>
          <li>外出: 旅途平安, 一路顺风. </li>
          <li>婚恋: 美好姻缘, 相亲相爱, 彼此忠诚, 白头到老. </li>
          <li>决策: 心地善良, 待人忠诚、厚道, 乐于帮助他人, 也能得到回报. 工作勤恳, 对自己要求严格, 可以实现自己的理想, 但要多动脑筋, 多思考, 善于判断是非, 尤其要注意选择朋友, 一旦结上品行不端的人, 会成为自己的祸患. 如果与比自己高明的人交朋友, 并取得帮助, 会终身受益. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 59)  }">
      <h2>风天小畜(xù) 巽上乾下</h2>
      <div class='guaci'>
        小畜: 亨.  密云不雨, 自我西郊. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 复自道, 何其咎, 吉. 
          </li>
          <li>九二: 牵复, 吉. 
          </li>
          <li>九三: 舆说辐, 夫妻反目. 
          </li>
          <li>六四: 有孚, 血去惕出, 无咎. 
          </li>
          <li>九五: 有孚挛如, 富以其邻. 
          </li>
          <li>上九: 既雨既处, 尚德载, 妇贞厉.  月几望, 君子征凶</li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 小畜； 柔得位, 而上下应之, 曰小畜.  健而巽, 刚中而志行, 乃
        亨.  密云不雨, 尚往也.  自我西郊, 施未行也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 风行天上, 小畜；君子以懿文德. 
        复自道, 其义吉也. 
        牵复在中, 亦不自失也. 
        夫妻反目, 不能正室也. 
        有孚惕出, 上合志也. 
        有孚挛如, 不独富也. 
        既雨既处, 德积载也.  君子征凶, 有所疑也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
      <ul>
        <li>象曰: 苗逢旱天尽焦梢, 水想云浓雨不浇, 农人仰面长吁气, 是从款来莫心高. </li>
        <li>这个卦是异卦（下乾上巽）相叠, 乾为天；巽为风. 喻风调雨顺, 谷物滋长, 故卦名小畜（蓄）. 力量有限, 须待发展到一定程度, 才可大有作为. </li>
        <li>事业: 时机尚不成熟, 应当耐心而积极地积存力量, 切不可冒险行动. 遇到挫折不可灰心, 鼓起勇气战胜困难, 坚持原则, 加强团结合作, 提前做好各项准备, 会有所成. </li>
        <li>经商: 已有一定的基础, 但有失去危险, 一定要特别慎重, 争取与他人真诚合作, 共同获利, 决不贪心, 适可而止, 但更不能满足现状, 不图进取. </li>
        <li>求名: 树立远大目标, 尽最大努力去争取, 虚心求教他人, 取得真诚帮助, 实现自己的理想, 警惕小人的破坏. </li>
        <li>外出: 准备尚未充分, 不得仓促出行, 尤其忌长途旅行, 会有意外的灾害. 应另择他日外出. </li>
        <li>婚恋: 双方必须十分忠诚, 第三者插足的现象极有可能发生. </li>
        <li>决策: 不很顺利, 前进途中会遇到一些意想不到的困难. 但由于本人性格坚强, 具有战胜不利条件的意志. 因此, 可以实理自己的理想. 但极有可能遭到小人的伤害, 必须得到志同道合者的真诚相助, 才能可能排除障碍. 对所得应满足, 适可而止, 切不可过度追求, 以免满招损. </li>
      </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 55)  }">
      <h2>天泽履(lǚ) 乾上兑下</h2>
      <div class='guaci'>
        履: 履虎尾, 不咥人, 亨. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 素履往, 无咎. 
          </li>
          <li>九二: 履道坦坦, 幽人贞吉. 
          </li>
          <li>六三: 眇能视, 跛能履, 履虎尾, 咥人, 凶.  武人为于大君. 
          </li>
          <li>九四: 履虎尾, 愬愬, 终吉. 
          </li>
          <li>九五: 夬履, 贞厉. 
          </li>
          <li>上九: 视履考祥, 其旋元吉. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 履, 柔履刚也. 说而应乎乾, 是以履虎尾, 不咥人, 亨. 刚中正, 
        履帝位而不疚, 光明也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 上天下泽, 履；君子以辩上下, 定民志. 
        素履之往, 独行愿也. 
        幽人贞吉, 中不自乱也. 
        眇能视；不足以有明也. 跛能履；不足以与行也. 咥人之凶；位不当也.  武人为于大君；志刚也. 
        愬愬终吉, 志行也. 
        夬履贞厉, 位正当也. 
        元吉在上, 大有庆也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 凤凰落在西歧山, 去鸣几声出圣贤, 天降文王开基业, 富贵荣华八百年. </li>
          <li>这个卦是异卦（下兑上乾）相叠, 乾为天；兑为泽, 以天喻君, 以泽喻民, 原文: "履（踩）虎尾、不咥（咬）人. "因此, 结果吉利. 君上民下, 各得其位. 兑柔遇乾刚, 所履危. 履意为实践, 卦义是脚踏实地的向前进取的意思. </li>
          <li>事业: 起初很不顺利, 受到种种威胁, 若能提高警惕, 谨小慎微, 脚踏实地, 逐个地去克服困难, 不改变自己的决心, 一定可以达到目的. 办事有自知之明, 务必量力而行, 不可不顾实际, 尤其不得逞强, 急于求成. </li>
          <li>经商: 宜待观动静, 勿为小利而动摇自己计划, 尤其不得贪得无厌, 遵循商业道德, 了解全面信息. </li>
          <li>求名: 务必有恒心, 孜孜以求, 不为财富利诱, 不为世俗干扰, 坚持自己的志向和理想, 可以取得成功. </li>
          <li>外出: 有惊无险, 可以外出, 但非紧急情况可以缓行. </li>
          <li>婚恋: 双方安贫乐道, 可和睦相处, 若一方为富贵所动, 会发生婚变. </li>
          <li>决策: 诸事必须小心慎重, 不利的情况经常会出现, 但若能处理得好, 总会是有惊无险, 化险为夷. 为此, 办事必须认认真真, 遵循正道, 虚心听取别人的建议, 量力而行, 切莫自负逞强, 一定会有好的结果. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 56)  }">
      <h2>地天泰 坤上乾下</h2>
      <div class='guaci'>
        泰: 小往大来, 吉亨. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 拔茅茹, 以其汇, 征吉. 
          </li>
          <li>九二: 包荒, 用冯河, 不遐遗, 朋亡, 得尚于中行. 
          </li>
          <li>九三: 无平不陂, 无往不复, 艰贞无咎.  勿恤其孚, 于食有福. 
          </li>
          <li>六四: 翩翩不富, 以其邻, 不戒以孚. 
          </li>
          <li>六五: 帝乙归妹, 以祉元吉. 
          </li>
          <li>上六: 城复于隍, 勿用师.  自邑告命, 贞吝. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 泰, 小往大来, 吉亨. 则是天地交, 而万物通也；上下交, 而其志同也. 
        内阳而外阴, 内健而外顺, 内君子而外小人, 君子道长, 小人道消也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 天地交, 泰, 后以财(=裁)成天地之道, 辅相天地之宜, 以左右民. 
        拔茅征吉, 志在外也. 
        包荒, 得尚于中行, 以光大也. 
        无往不复, 天地际也. 
        翩翩不富, 皆失实也.  不戒以孚, 中心愿也. 
        以祉元吉, 中以行愿也. 
        城复于隍, 其命乱也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 凤凰落在西歧山, 去鸣几声出圣贤, 天降文王开基业, 富贵荣华八百年. </li>
          <li>这个卦是异卦（下兑上乾）相叠, 乾为天；兑为泽, 以天喻君, 以泽喻民, 原文: "履（踩）虎尾、不咥（咬）人. "因此, 结果吉利. 君上民下, 各得其位. 兑柔遇乾刚, 所履危. 履意为实践, 卦义是脚踏实地的向前进取的意思. </li>
          <li>事业: 起初很不顺利, 受到种种威胁, 若能提高警惕, 谨小慎微, 脚踏实地, 逐个地去克服困难, 不改变自己的决心, 一定可以达到目的. 办事有自知之明, 务必量力而行, 不可不顾实际, 尤其不得逞强, 急于求成. </li>
          <li>经商: 宜待观动静, 勿为小利而动摇自己计划, 尤其不得贪得无厌, 遵循商业道德, 了解全面信息. </li>
          <li>求名: 务必有恒心, 孜孜以求, 不为财富利诱, 不为世俗干扰, 坚持自己的志向和理想, 可以取得成功. </li>
          <li>外出: 有惊无险, 可以外出, 但非紧急情况可以缓行. </li>
          <li>婚恋: 双方安贫乐道, 可和睦相处, 若一方为富贵所动, 会发生婚变. </li>
          <li>决策: 诸事必须小心慎重, 不利的情况经常会出现, 但若能处理得好, 总会是有惊无险, 化险为夷. 为此, 办事必须认认真真, 遵循正道, 虚心听取别人的建议, 量力而行, 切莫自负逞强, 一定会有好的结果. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 7)  }">
      <h2>天地否(pǐ) 乾上坤下</h2>
      <div class='guaci'>
        否: 否之匪人, 不利君子贞, 大往小来. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 拔茅茹, 以其汇, 贞吉亨. 
          </li>
          <li>六二: 包承.  小人吉, 大人否亨. 
          </li>
          <li>六三: 包羞. 
          </li>
          <li>九四: 有命无咎, 畴离祉. 
          </li>
          <li>九五: 休否, 大人吉.  其亡其亡, 系于苞桑. 
          </li>
          <li>上九: 倾否, 先否后喜. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 否之匪人, 不利君子贞.  大往小来,  则是天地不交, 而万物不通也；
        上下不交, 而天下无邦也. 内阴而外阳, 内柔而外刚, 内小人而外君子.  小人道长, 君子道消也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 天地不交, 否；君子以俭德辟难, 不可荣以禄. 
        拔茅贞吉, 志在君也. 
        大人否亨, 不乱群也. 
        包羞, 位不当也. 
        有命无咎, 志行也. 
        大人之吉, 位正当也. 
        否终则倾, 何可长也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 虎落陷坑不堪言, 进前容易退后难, 谋望不遂自己便, 疾病口舌事牵连. </li>
          <li>这个卦是异卦（下坤上乾）相叠, 其结构同泰卦相反, 系阳气上升, 阴气下降, 天地不交, 万物不通. 它们彼此为"综卦", 表明泰极而否, 否极泰来, 互为因果. </li>
          <li>事业: 陷入逆境, 事业处于衰退阶段, 多有不顺利. 受小人干扰而不得志, 爱挫折. 应坚持正道, 勿与小人合流, 团结志同道合者, 自保以等待时机. 保持自信心, 戒慎恐惧, 形势定会好转, 事业终能成功. </li>
          <li>经商: 遇到强大的竞争对手, 处于不利地位. 信息不灵造成重大损失. 应格外小心谨慎, 坚持守势, 等待有利时机到来, 再发展自己的营销事业. </li>
          <li>求名: 条件还不成熟, 再努力一阵子, 并得到他人的帮助, 理想可以实现. </li>
          <li>外出: 会遇到不少麻烦和困难, 宜推迟或提前行动. </li>
          <li>婚恋: 容易出现节外生枝的事情, 甚至发生挫折和变故, 双方若都充满信心, 好的结果会出现. </li>
          <li>决策: 本人聪慧, 精明, 勤奋努力, 但不注意人际关系, 加上小人的排斥, 命运或遭厄运. 意志坚强, 具有奋斗精神, 且克服了不足, 尽管付出的代价很高, 必能成全事业. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 47)  }">
      <h2>天火同人 乾上离下</h2>
      <div class='guaci'>
        同人: 同人于野, 亨.  利涉大川, 利君子贞. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 同人于门, 无咎. 
          </li>
          <li>六二: 同人于宗, 吝. 
          </li>
          <li>九三: 伏戎于莽, 升其高陵, 三岁不兴. 
          </li>
          <li>九四: 乘其墉, 弗克攻, 吉. 
          </li>
          <li>九五: 同人, 先号啕而后笑.  大师克相遇. 
          </li>
          <li>上九: 同人于郊, 无悔. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 同人, 柔得位得中, 而应乎乾, 曰同人.  同人曰, 同人于野, 亨. 
        利涉大川, 乾行也.  文明以健, 中正而应, 君子正也.  唯君子为能通天下之志. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 天与火, 同人；君子以类族辨物. 
        出门同人, 又谁咎也. 
        同人于宗, 吝道也. 
        伏戎于莽, 敌刚也.  三岁不兴, 安行也. 
        乘其墉, 义弗克也, 其吉, 则困而反则也. 
        同人之先, 以中直也.  大师相遇, 言相克也. 
        同人于郊, 志未得也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 心中有事犯猜疑, 谋望从前不着实, 幸遇明人来指引, 诸般忧闷自消之. </li>
          <li>这个卦是异卦（下离上乾）相叠, 乾为天, 为君；离为火, 为臣民百姓, 上天下火, 火性上升, 同于天, 上下和同, 同舟共济, 人际关系和谐, 天下大同. </li>
          <li>事业: 顺利、平安、尤其是在与他人的合作方面会十分成功, 宜广泛开展人际活动, 建立广泛的联系, 克服狭隘的门户之见, 照顾各方面的利益, 求大同, 存小异, 坚持正确的原则, 必能成就大事业. </li>
          <li>经商: 以真诚合作、精诚团结的态度与同行共事, 公平竞争, 必可获得自己应得的利益. </li>
          <li>求名: 自己必须刻苦努力, 尤其必要取行师长和志同道全的朋友的指教、帮助, 自己虚心进取, 完全能够达到目的. </li>
          <li>外出: 很平安、顺利, 并可以结交新朋友, 获得帮助. </li>
          <li>婚恋: 多情、善交际, 认识的异性朋友多, 故需慎重选择, 注意维护双方关系和家庭和睦. </li>
          <li>决策: 性格开朗、乐观, 为人热情, 人际关系好, 社交能力强, 要善于同他人合作, 尤其要协调多方面的关系, 要有原则性, 与不良风气斗争, 有魄力, 敢作敢为, 富有自我奉献精神, 并具有统御能力, 适于担任一定的负责. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 61)  }">
      <h2>火天大有 离上乾下</h2>
      <div class='guaci'>
        大有: 元亨. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 无交害, 匪咎, 艰则无咎. 
          </li>
          <li>九二: 大车以载, 有攸往, 无咎. 
          </li>
          <li>九三: 公用亨于天子, 小人弗克. 
          </li>
          <li>九四: 匪其彭, 无咎. 
          </li>
          <li>六五: 厥孚交加, 威如；吉. 
          </li>
          <li>上九: 自天祐之, 吉无不利. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 大有, 柔得尊位, 大中而上下应之, 曰大有. 其德刚健而文明, 应
        乎天而时行, 是以元亨. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 火在天上, 大有；君子以遏恶扬善, 顺天休命. 
        大有初九, 无交害也. 
        大车以载, 积中不败也. 
        公用亨于天子, 小人害也. 
        匪其彭, 无咎；明辨晢也. 
        厥孚交加, 信以发志也.  威如之吉, 易而无备也. 
        大有上吉, 自天祐也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 砍树摸雀作事牢, 是非口舌自然消, 婚姻合伙来费力, 若问走失未逃脱. </li>
          <li>这个卦是异卦（下乾上离）相叠. 上卦为离, 为火；下卦为乾, 为天. 火在天上, 普照万物, 万民归顺, 顺天依时, 大有所成. </li>
          <li>事业: 事业已经取得一定的成就, 最忌得意忘形, 胡作非为. 务必止恶扬善, 坚守中止, 交往正直的朋友, 戒惧谨慎, 兢兢业业, 真正做到大而不盈, 满而不溢, 事业可望迈上新的台阶. </li>
          <li>经商: 兴隆昌盛, 已摆脱困难状态, 进入兴旺发达的阶段, 如能克制贪财的心理, 确守诚信原则, 公平待人, 克勤克俭, 尤其应时刻注意市场动向, 适时转轨, 可望长久. </li>
          <li>求名: 已经小有名气, 切勿就此满足, 停顿不前, 尤其不可陷入世俗圈内, 应继续努力, 在真正朋友的帮助下, 更上一层楼. </li>
          <li>外出: 平安, 可动身. </li>
          <li>婚恋: 条件优越, 可供选择者多, 以慎重为好. 对于家庭双方应尽力维护. </li>
          <li>决策: 性格坚强, 勇于战胜困难, 奋斗向上, 前进途中困难和厄运很多, 唯有认真对待才能不断取得成功, 如放松警惕, 骄傲自满, 将带来惨重失败. 朋友很多, 交际广泛, 对事业很有帮助, 但其中也有拆台的小人. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 8)  }">
      <h2>地山谦 坤上艮下</h2>
      <div class='guaci'>
        谦: 亨, 君子有终. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 谦谦君子, 用涉大川, 吉. 
          </li>
          <li>六二: 鸣谦, 贞吉. 
          </li>
          <li>九三: 劳谦, 君子有终, 吉. 
          </li>
          <li>六四: 无不利, 撝谦. 
          </li>
          <li>六五: 不富, 以其邻, 利用侵伐, 无不利. 
          </li>
          <li>上六: 鸣谦, 利用行师, 征邑国. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 谦, 亨, 天道下济而光明, 地道卑而上行. 天道亏盈而益谦, 地道
        变盈而流谦, 鬼神害盈而福谦, 人道恶盈而好谦. 谦尊而光, 卑而
        不可逾, 君子之终也. </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 地中有山, 谦；君子以裒多益寡, 称物平施. 
        谦谦君子, 卑以自牧也. 
        鸣谦贞吉, 中心得也. 
        劳谦君子, 万民服也. 
        无不利, 撝谦；不违则也. 
        利用侵伐, 征不服也. 
        鸣谦, 志未得也.  可用行师, 征邑国也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 天赐贫人一封金, 不争不抢两平分, 彼此分得金到手, 一切谋望皆遂心. </li>
          <li>这个卦是异卦（下艮上坤）相叠, 艮为山, 坤为地. 地面有山, 地卑（低）而山高, 是为内高外低, 比喻功高不自居, 名高不自誉, 位高不自傲. 这就是谦. </li>
          <li>事业: 尚未被人器重, 但因品德高尚, 终会为人发现. 自己不必有意表现, 尤其不可放弃谦虚的美德, 埋头苦干, 一定会得到他人的帮助, 在事业上大有作为. </li>
          <li>经商: 较为顺利, 但不会获暴利, 须逐步积累, 故应极其小心谨慎, 诚心与他人合作, 遵守商业道德, 通过自已的勤劳努力, 取得商业的发展. </li>
          <li>求名: 天资聪明, 但因性格不善于表现自己, 起初往往被埋没, 自己只要不灰心, 继续努力钻研业务, 保持谦逊好学精神, 更大的成功正在未来. </li>
          <li>外出: 顺利, 但应准备充分, 途中小心, 渐可忽视安全. </li>
          <li>婚恋: 美满的婚姻应由双方共同去努力争取. 否则, 恋爱不成功, 家庭不能和睦. </li>
          <li>决策: 具有内高外低的谦虚美德, 善于团结他人, 也能得到别人的帮助, 事业很顺利, 遇到困难, 很快可以化险为夷, 有惊无险. 由于能够认真吸取别人的长处, 进步很快, 会畅通无阻, 但需要特别注意学业、德业和修养. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 4)  }">
      <h2>雷地豫 震上坤下</h2>
      <div class='guaci'>
        豫: 利建侯行师. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 鸣豫, 凶. 
          </li>
          <li>六二: 介于石, 不终日, 贞吉. 
          </li>
          <li>六三: 盱豫, 悔.  迟有悔. 
          </li>
          <li>九四: 由豫, 大有得. 勿疑.  朋盍簪. 
          </li>
          <li>六五: 贞疾, 恒不死. 
          </li>
          <li>上六: 冥豫成, 有渝, 无咎. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 豫, 刚应而志行, 顺以动, 豫. 豫, 顺以动, 故天地如之, 而况建
        侯行师乎？天地以顺动, 故日月不过, 而四时不忒；圣人以顺动, 
        则刑罚清而民服.  豫之时义大矣哉！
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 雷出地奋, 豫.  先王以作乐崇德, 殷荐之上帝, 以配祖考. 
        初六鸣豫, 志穷凶也. 
        不终日, 贞吉；以中正也. 
        盱豫有悔, 位不当也. 
        由豫, 大有得；志大行也. 
        六五贞疾, 乘刚也.  恒不死, 中未亡也. 
        冥豫在上, 何可长也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 太公插下杏黄旗, 收妖为徒归西歧, 自此青龙得了位, 一旦谋望百事宜. </li>
          <li>这个卦是异卦（下坤上震）相叠, 坤为地, 为顺；震为雷, 为动. 雷依时出, 预示大地回春. 因顺而动, 和乐之源. 此卦与谦卦互为综卦, 交互作用. </li>
          <li>事业: 十分顺利, 事业可以获得成功, 但必须符合实际, 顺应潮流, 且得自己努力奋斗, 树立远大目光, 尤其不可因事业的顺利而放松谨慎小心的态度, 陷于懒散享乐. 否则, 必将后悔莫及. </li>
          <li>经商: 时运已到, 应大胆行动, 即使发生挫折, 也可以很快化险为夷. 应加强同他人的合作, 开诚布公, 共同开发事业. </li>
          <li>求名: 天资聪颖, 如能坚守正直的品德, 严格要求自己, 努力上进, 不因有成绩骄傲满足, 停止前进, 而是兢兢业业, 不惰不怠, 必定可以有重大成功. </li>
          <li>外出: 充分准备, 从容出发, 会十分顺利和平安. </li>
          <li>婚恋: 十分顺利, 一生顺利和吉祥, 但万不可掉以轻心, 更不可玩弄感情, 否则将会出现悲剧. </li>
          <li>决策: 一生顺利, 不会出现大的波折, 容易比较顺利得到自己应该得到的. 但关键在于自己的努力和奋斗, 不得耽于安乐, 不可玩物丧志. 豁达、大度更有利于健康和长寿. 一旦遇到意外的灾害, 只要时时严格要求自己, 坚守纯正, 乐不忘忧, 居安思危, 必可转危为安. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 38)  }">
      <h2>泽雷随 兑上震下</h2>
      <div class='guaci'>
        随: 元亨利贞, 无咎. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 官有渝, 贞吉.  出门交有功. 
          </li>
          <li>六二: 系小子, 失丈夫. 
          </li>
          <li>六三: 系丈夫, 失小子.  随有求得, 利居贞. 
          </li>
          <li>九四: 随有获, 贞凶. 有孚在道, 以明, 何咎. 
          </li>
          <li>九五: 孚于嘉, 吉. 
          </li>
          <li>上六: 拘系之, 乃从维之.  王用亨于西山. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 随, 刚来而下柔, 动而说, 随. 大亨贞, 无咎, 而天下随时, 随时之义大矣哉！</div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 泽中有雷, 随；君子以向晦入宴息. 
        官有渝, 从正吉也.  出门交有功, 不失也. 
        系小子, 弗兼与也. 
        系丈夫, 志舍下也. 
        随有获, 其义凶也.  有孚在道, 明功也. 
        孚于嘉, 吉；位正中也. 
        拘系之, 上穷也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 泥里步踏这几年, 推车靠崖在眼前, 目下就该再使力, 扒上崖去发财源. </li>
          <li>这个卦是异卦（下震上兑）相叠, 震为雷、为动；兑为悦. 动而悦就是"随". 随指相互顺从, 己有随物, 物能随己, 彼此沟通. 随必依时顺势, 有原则和条件, 以坚贞为前提. </li>
          <li>事业: 对社会和人生有正确的估价, 重视人际关系, 善于同他人合作, 事业会很顺利. 为了保证取得更进一步的成功, 不得贪图小利, 向比自己优秀的人学习, 择善而从, 心存诚信、努力开拓事业. </li>
          <li>经商: 顺利. 在与他人的真诚合作下, 能够达到预期的目的. 在竞争中应保持清醒头脑, 从大处、长远考虑, 遵守商业道德, 保持至诚的态度对待顾客和同行, 会保持竞争优势. </li>
          <li>求名: 在自己刻苦钻研的基础上, 虚心向有德有才的师长学习, 借助外界的力量, 促使自己更快的进步, 实现个人的理想. </li>
          <li>外出: 吉利. 可以改变处境. </li>
          <li>婚恋: 双方情投意合可以成功, 家庭和睦, 但若迷恋于情爱, 会影响双方的事业, 务必注意. </li>
          <li>决策: 个人成长道路并不十分顺利, 但由于谦虚、随和, 人际关系好, 尤其能够得到长辈的器重, 各种事都能在他人的帮助和关心下成功. 但务必注意追随他人应有的立场和原则, 不可趋炎附势, 招致祸凶. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 25)  }">
      <h2>山风蛊(gǔ) 艮上巽下</h2>
      <div class='guaci'>
        蛊: 元亨, 利涉大川.  先甲三日, 后甲三日. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 干父之蛊, 有子, 考无咎, 厉终吉. 
          </li>
          <li>九二: 干母之蛊, 不可贞. 
          </li>
          <li>九三: 干父之蛊, 小有悔, 无大咎. 
          </li>
          <li>六四: 裕父之蛊, 往见吝. 
          </li>
          <li>六五: 干父之蛊, 用誉. 
          </li>
          <li>上九: 不事王侯, 高尚其事. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 蛊, 刚上而柔下, 巽而止, 蛊.  蛊, 元亨, 而天下治也.  利涉大
        川, 往有事也.  先甲三日, 后甲三日, 终则有始, 天行也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 山下有风, 蛊；君子以振民育德. 
        干父之蛊, 意承考也. 
        干母之蛊, 得中道也. 
        干父之蛊, 终无咎也. 
        裕父之蛊, 往未得也. 
        干父之蛊；承以德也. 
        不事王侯, 志可则也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 卦中爻象如推磨, 顺当为福反为祸, 心中有益且迟迟, 凡事尽从忙处错. </li>
          <li>这个卦是异卦（下巽上艮）相叠, 与随卦互为综卦. 蛊（gu）本意为事, 引申为多事、混乱. 器皿久不用而生虫称"蛊", 喻天下久安而因循、腐败, 必须革新创造, 治理整顿, 挽救危机, 重振事业. </li>
          <li>事业: 运气处于不佳状态, 或因外界条件, 或因个人因素所致. 唯有谨慎分析原因, 找出弊端, 坚决, 大胆, 不惜冒险, 战胜阻力. 这时一要头脑冷静, 二要向高明的人请教, 必能创造业绩. </li>
          <li>经商: 诸多不利困扰着自己, 不宜继续走老路. 应全面分析市场动向, 当机立断, 另外找寻出路. </li>
          <li>求名: 会遇到许多困难和不利, 应看作是对自己的考验, 要以百倍的勇气, 继续奋斗. 同时, 虚心寻找自己的不足, 加以补救. </li>
          <li>外出: 宜推迟或提前. 否则会出现危险, 务必小心谨慎. </li>
          <li>婚恋: 不顺利. 双方如情投意合, 则应全力以赴促成此事, 夫妇应共同努力维系家庭. </li>
          <li>决策: 生不逢时, 家道或事业有中落现象, 个人陷入多事之秋. 唯有正视现实, 勤奋勉励, 不屈不挠, 有所作为, 甚至不惜冒险, 挽救败落状况. 必要时还需耐心等待时机. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 48)  }">
      <h2>地泽临 坤上兑下</h2>
      <div class='guaci'>
        临: 元, 亨, 利, 贞.  至于八月有凶. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 咸临, 贞吉. 
          </li>
          <li>九二: 咸临, 吉无不利. 
          </li>
          <li>六三: 甘临, 无攸利.  既忧之, 无咎. 
          </li>
          <li>六四: 至临, 无咎. 
          </li>
          <li>六五: 知临, 大君之宜, 吉. 
          </li>
          <li>上六: 敦临, 吉无咎. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 临, 刚浸而长.  说而顺, 刚中而应, 大亨以正, 天之道也.  至于
        八月有凶, 消不久也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 泽上有地, 临； 君子以教思无穷, 容保民无疆. 
        咸临贞吉, 志行正也. 
        咸临, 吉无不利；未顺命也. 
        甘临, 位不当也.  既忧之, 咎不长也. 
        至临无咎, 位当也. 
        大君之宜, 行中之谓也. 
        敦临之吉, 志在内也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 君王无道民倒悬, 常想拨云见青天, 幸逢明主施仁政, 重又安居乐自然. </li>
          <li>这个卦是异卦（下兑上坤）相叠. 坤为地；兑为泽, 地高于泽, 泽容于地. 喻君主亲临天下, 治国安邦, 上下融洽. </li>
          <li>事业: 正是成功的极好时机, 务必抓紧, 不可失去良机. 但却不可就此满足, 时运会很快消失, 一定要从长计议, 注意总结经验, 团结他人, 共同开拓新领域. </li>
          <li>经商: 会十分顺利, 并有收获, 但须随时注意市场动向, 兢兢业业, 防止出现意外的事故, 尤其应妥善处理人际关系. </li>
          <li>求名: 自己的努力已到了收获的季节, 应更加虚心, 严格要求自己, 谨慎小心地实现自己的目标. 很可能出现意外, 应以刚强的意志去从容对付, 过于软弱将失去机会. </li>
          <li>外出: 在准备充分的情况下, 立即行动, 不必再犹豫. </li>
          <li>婚恋: 加紧进行, 全力以赴, 双方以诚信相待, 美满、和谐. </li>
          <li>决策: 头脑灵活, 善于同他人交往, 并有主见, 具有领导才能. 务必加强个人的全面修养, 诚信待人, 树立良好的个人威望, 尤其要有远大的眼光, 长久的计划, 可以保证事业的发达和前程的光明. 所作为, 甚至不惜冒险, 挽救败落状况. 必要时还需耐心等待时机. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 3)  }">
      <h2>风地观 巽上坤下</h2>
      <div class='guaci'>
        观: 盥而不荐, 有孚顒若. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 童观, 小人无咎, 君子吝. 
          </li>
          <li>六二: 窥观, 利女贞. 
          </li>
          <li>六三: 观我生, 进退. 
          </li>
          <li>六四: 观国之光, 利用宾于王. 
          </li>
          <li>九五: 观我生, 君子无咎. 
          </li>
          <li>上九: 观其生, 君子无咎. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 大观在上, 顺而巽, 中正以观天下. 观, 盥而不荐, 有孚顒若, 下观而化也. 
        观天之神道, 而四时不忒,  圣人以神道设教, 而天下服矣. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 风行地上, 观；先王以省方, 观民设教. 
        初六童观, 小人道也. 
        窥观女贞, 亦可丑也. 
        观我生, 进退；未失道也. 
        观国之光, 尚宾也. 
        观我生, 观民也. 
        观其生, 志未平也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 卦遇蓬花旱逢河, 生意买卖利息多, 婚姻自有人来助, 出门永不受折磨. </li>
          <li>这个卦是异卦（下坤上巽）相叠, 风行地上, 喻德教遍施. 观卦与临卦互为综卦, 交相使用. 在上者以道义观天下；在下者以敬仰瞻上, 人心顺服归从. </li>
          <li>事业: 事业已出现不顺利的迹象, 务必谦虚慎重, 高瞻远瞩, 尤忌短期行为, 心胸开阔, 注意搞好人际关系, 团结他人, 不宜轻率行动. 必要时不妨投靠德行高的人, 以图再度发展. </li>
          <li>经商: 市场形势不稳定, 正处于变动, 应谨慎小心, 随时观察动向, 从长计议, 做好退却的准备. </li>
          <li>求名: 贵在自知之明, 虚心向他人求教, 端正处世态度, 尤其不可自我满足, 更须守中持正, 树立远大理想, 勿丧失个人追求的目标, 勿偏离正道. </li>
          <li>外出: 有风险, 择日而行. </li>
          <li>婚恋: 不顺利, 双方应经受住考验, 从长计议, 会有理想的结果. </li>
          <li>决策: 具有组织能力, 适宜担任负责工作, 但人生旅途多曲折, 必须注意培养自己的预见性和观察力, 办事务必公正, 实事求是, 注意人心动向, 关心他人. 尤其不可以陷入小人之道和近视行为之中. 应有决断精神, 不可盲从, 必要时可进行策略依附. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 37)  }">
      <h2>火雷噬嗑(shìhé) 离上震下</h2>
      <div class='guaci'>
        噬嗑: 亨.  利用狱. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 屦校灭趾, 无咎. 
          </li>
          <li>六二: 噬肤灭鼻, 无咎. 
          </li>
          <li>六三: 噬腊肉, 遇毒；小吝, 无咎. 
          </li>
          <li>九四: 噬干胏, 得金矢, 利艰贞, 吉. 
          </li>
          <li>六五: 噬干肉, 得黄金, 贞厉, 无咎. 
          </li>
          <li>上九: 何校灭耳, 凶. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 颐中有物, 曰噬嗑, 噬嗑而亨. 刚柔分, 动而明, 雷电合而章. 柔
        得中而上行, 虽不当位, 利用狱也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 雷电噬嗑；先王以明罚敕法. 
        屦校灭趾, 不行也. 
        噬肤灭鼻, 乘刚也. 
        遇毒, 位不当也. 
        利艰贞吉, 未光也. 
        贞厉无咎, 得当也. 
        何校灭耳, 聪不明也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 运拙如同身受饥, 幸得送饭又送食, 适口充腹心欢喜, 忧愁从此渐消移. </li>
          <li>这个卦是异卦（下震上离）相叠. 离为阴卦；震为阳卦. 阴阳相交, 咬碎硬物, 喻恩威并施, 宽严结合, 刚柔相济. 噬嗑（shihe）为上下颚咬合, 咀嚼. </li>
          <li>事业: 困难与阻力非常大, 应以坚强的意志, 果敢的行为, 公正无私的态度去战胜种种厄运, 争取事态好转. 为了早日化险为夷, 必要时可采取强硬手段, 甚至诉诸法律. </li>
          <li>经商: 处于不利的时候, 头脑冷静, 明察形势, 寻求机遇, 不为眼前小利所诱, 不发非分之财. 认真听取忠告, 遵守法纪, 秉公办事, 不得徇私情, 更警惕不得触犯刑律. </li>
          <li>求名: 自己的努力尚不为人所知, 不可急于求成, 受到挫折应看作是对自己的考验, 持之以恒, 必能成功. </li>
          <li>外出: 另择他日为佳. 若非出门不可, 务必充分准备, 小心为是. </li>
          <li>婚恋: 初不顺利, 须有顽强精神可以取得满意的结果, 不可以个的情绪左右家庭事务. </li>
          <li>决策: 一生不平坦, 会遇到挫折和磨难, 但应看作是对个人的考验, 应认真总结经验教训, 以更为坚强的意志, 不屈不挠, 继续前进. 经过锻炼, 各方面都会有较大的进展, 终将进入光明境地, 取得重大成就. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 41)  }">
      <h2>山火贲(bì) 艮上离下</h2>
      <div class='guaci'>
        贲: 亨.  小利有所往. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 贲其趾, 舍车而徒. 
          </li>
          <li>六二: 贲其须. 
          </li>
          <li>九三: 贲如濡如, 永贞吉. 
          </li>
          <li>六四: 贲如皤如, 白马翰如, 匪寇婚媾. 
          </li>
          <li>六五: 贲于丘园, 束帛戋戋, 吝, 终吉. 
          </li>
          <li>上九: 白贲, 无咎. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 贲, 亨；柔来而文刚, 故亨. 分刚上而文柔, 故小利有攸往. 刚柔交错, 天文也；
        文明以止, 人文也. 观乎天文, 以察时变；观乎人文, 以化成天下. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 山下有火, 贲；君子以明庶政, 无敢折狱. 
        舍车而徒, 义弗乘也. 
        贲其须, 与上兴也. 
        永贞之吉, 终莫之陵也. 
        六四, 当位疑也.  匪寇婚媾, 终无尤也. 
        六五之吉, 有喜也. 
        白贲无咎, 上得志也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 近来运转锐气周, 窈窕淑女君子求, 钟鼓乐之大吉庆, 占者逢之喜临头. </li>
          <li>这个卦是异卦（下离上艮）相叠. 离为火为明；艮为山为止. 文明而有节制. 贲（bi）卦论述文与质的关系, 以质为主, 以文调节. 贲, 文饰、修饰. </li>
          <li>事业: 顺利, 小有成绩, 宜即时总结经验, 图谋更大的发展. 树立信心, 不计较一时的得失. 追求实质性的内容, 慎重诸事, 不得随波逐流, 寻求有实力的人物提携自己. </li>
          <li>经商: 开初会遇到困难, 不应灰心, 宜全面分析形势, 大胆开拓, 勇敢地投入, 联合他人, 共同合作, 根据市场, 运转业务. </li>
          <li>求名: 不可过多地注重外表, 而应着重于内在的素质. 大胆地推荐自己, 但应坚持自己的理想. </li>
          <li>外出: 慎远行. 但只要准备充分, 注意安全, 不会出麻烦. </li>
          <li>婚恋: 慎重选择, 有合适者, 则应迫切追求, 不可三心二意, 务必专一. 注重对方的内在气质, 勿为表面现象所欺骗. </li>
          <li>决策: 喜爱注重外表, 缺乏追求内在气质的恒心. 生性较为浮躁, 好务虚名, 往往因此而碰壁, 或半途而废. 在事实的教育下, 改变不切实际的做法, 明察社会和人生, 会有所收敛, 变得自持, 注重自身修养, 成全事业, 中年以后会大有作为, 老年仍可发挥余热. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 1)  }">
      <h2>山地剥 艮上坤下</h2>
      <div class='guaci'>
        剥: 不利有攸往. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 剥床以足, 蔑贞凶. 
          </li>
          <li>六二: 剥床以辨, 蔑贞凶. 
          </li>
          <li>六三: 剥之, 无咎. 
          </li>
          <li>六四: 剥床以肤, 凶. 
          </li>
          <li>六五: 贯鱼, 以宫人宠, 无不利. 
          </li>
          <li>上九: 硕果不食, 君子得舆, 小人剥庐. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 剥, 剥也, 柔变刚也.  不利有攸往, 小人长也.  顺而止之, 观象
        也.  君子尚消息盈虚, 天行也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 山附地上, 剥；上以厚下, 安宅. 
        剥床以足, 以灭下也. 
        剥床以辨, 未有与也. 
        剥之无咎, 失上下也. 
        剥床以肤, 切近灾也. 
        以宫人宠, 终无尤也. 
        君子得舆, 民所载也.  小人剥庐, 终不可用也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 鹊遇天晚宿林中, 不知林内先有鹰, 虽然同处心生恶, 卦若逢之是非轻. </li>
          <li>这个卦是异卦（下坤上艮）相叠. 五阴在下, 一阳在上, 阴盛而阳孤；高山附于地. 二者都是剥落象, 故为"剥卦". 此卦阴盛阳衰, 喻小人得势, 君子困顿, 事业败坏. </li>
          <li>事业: 时运不佳, 乃大势所趋, 个人只能顺应时势而暂停行动, 静观待变, 不可冒险, 积极创造条件, 增强实力, 谨慎隐忍, 勿与小人同流. 时来运转, 成就事业, 为期不远. </li>
          <li>经商: 已从高峰转入低落, 进入不景气时期, 需要认真总结经验教训, 进行整顿, 尤其不可孤注一掷. 景气形势一旦到来, 可顺势从容再起. </li>
          <li>求名: 成功的可能性不大, 不宜执意强求, 应继续创造条件, 努力提高自己, 充实处世的本领, 增强实力, 待机东山再起. </li>
          <li>外出: 暂缓为好. 可在充分准备之后动身. </li>
          <li>婚恋: 务须慎重考虑, 除非有十分般配者, 不要随便进行. 双方应注意维护家庭的和睦. </li>
          <li>决策: 一生曲折较多, 往往隐入不顺利的境况, 甚至绝境. 但可绝处逢生. 只要冷静分析形势, 顽强拼搏, 一定会彻底改变命运, 获得美好的结果, 为他人惊羡. 关键是不可急于求成, 尤其不可冒险. 须顺应时势, 并防小人陷害. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 32)  }">
      <h2>地雷复 坤上震下</h2>
      <div class='guaci'>
        复: 亨.  出入无疾, 朋来无咎.  反复其道, 七日来复, 利有攸往. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 不远复, 无祗悔, 元吉. 
          </li>
          <li>六二: 休复, 吉. 
          </li>
          <li>六三: 频复, 厉无咎. 
          </li>
          <li>六四: 中行独复. 
          </li>
          <li>六五: 敦复, 无悔. 
          </li>
          <li>上六: 迷复, 凶, 有灾眚. 用行师, 终有大败, 以其国君, 凶；至于十年, 不克征. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 复亨；刚反, 动而以顺行, 是以出入无疾, 朋来无咎.  反复其道, 
        七日来复, 天行也.  利有攸往, 刚长也.  复其见天地之心乎？
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 雷在地中, 复；先王以至日闭关, 商旅不行, 后不省方. 
        不远之复, 以修身也. 
        休复之吉, 以下仁也. 
        频复之厉, 义无咎也. 
        中行独复, 以从道也. 
        敦复无悔, 中以自考也. 
        迷复之凶, 反君道也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 马氏太公不相合, 世人占之忧疑多, 恩人无义反为怨, 是非平地起风波. </li>
          <li>这个卦是异卦（下震上坤）相叠. 震为雷、为动；坤为地、为顺, 动则顺, 顺其自然. 动在顺中, 内阳外阴, 循序运动, 进退自如, 利于前进. </li>
          <li>事业: 已经渡过了困难时期, 开始进入积极行动的阶段. 但务必抓住时机, 当机立断, 却不可急躁, 且应时常反省个人行动, 严于修身, 勇往直前, 可望成功. </li>
          <li>经商: 可大胆投资, 与志同道合的伙伴坦诚合作, 打开市场, 勿因挫折而退缩. 更可以打入外地, 坚持商业道德, 循序渐进, 一定会有所赢利. </li>
          <li>求名: 时机正在成熟, 不要急于求成, 继续奠定基础, 机遇一旦到来, 务必要抓住, 必将转运. 最忌自伤意志. </li>
          <li>外出: 无灾无祸, 且有收获. </li>
          <li>婚恋: 顺利. 但切不可性急, 应冷静考虑. 家庭的美满幸福, 靠严于律己维持. </li>
          <li>决策: 性格活泼, 精力旺盛, 但因急躁情绪会造成事业损失. 一定要冷静思考, 勇于改正错误, 必能重振事业. 此时应抓住时机, 明确方向, 灵活机敏, 脚踏实地改变处境. 一旦出现意外, 宜当机立断, 暂行退让. 如能准确驾驶自己, 努力奋斗, 成就事业十分顺利. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 39)  }">
      <h2>天雷无妄 乾上震下</h2>
      <div class='guaci'>
        无妄: 元, 亨, 利, 贞.  其匪正有眚, 不利有攸往. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 无妄, 往吉. 
          </li>
          <li>六二: 不耕获, 不菑畲, 则利有攸往. 
          </li>
          <li>六三: 无妄之灾, 或系之牛, 行人之得, 邑人之灾. 
          </li>
          <li>九四: 可贞, 无咎. 
          </li>
          <li>九五: 无妄之疾, 勿药有喜. 
          </li>
          <li>上九: 无妄行, 有眚, 无攸利. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 无妄, 刚自外来, 而为主於内. 动而健, 刚中而应, 大亨以正, 天之命也. 
        其匪正有眚, 不利有攸往. 无妄之往, 何之矣？ 天命不祐, 行矣哉？
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 天下雷行, 物与无妄；先王以茂对时, 育万物. 
        无妄之往, 得志也. 
        不耕获, 未富也. 
        行人得牛, 邑人灾也. 
        可贞无咎, 固有之也. 
        无妄之药, 不可试也. 
        无妄之行, 穷之灾也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 飞鸟失机落笼中, 纵然奋飞不能腾, 目下只宜守本分, 妄想扒高万不能. </li>
          <li>这个卦是异卦（下震上乾）相叠. 乾为天为刚为健；震为雷为刚为动. 动而健, 刚阳盛, 人心振奋, 必有所得, 但唯循纯正, 不可妄行. 无妄必有获, 必可致福. </li>
          <li>事业: 贵自知之明, 从个人实际出发, 不抱非分之想, 脚踏实地, 勤奋努力, 检点行为, 防意外灾祸. 不计较得失, 诚心追求, 待机而动, 事业必成. </li>
          <li>经商: 切勿勉为其难, 遵循市场规律, 讲究商业道德, 屏弃投机心理, 勿贪暴利, 经过辛勤努力, 日积月累, 必将成功. </li>
          <li>求名: 以良好的动机, 刻苦努力, 丢弃幻想, 但问耕耘, 不问收获, 终将有所获. </li>
          <li>外出: 不存妄想则平安无事. 为谋私利或邪念而行则大为不利, 不宜行. </li>
          <li>婚恋: 双方务以诚相待, 绝不可抱以轻率的态度, 亦不宜急于求成、顺其发展, 水到渠成. </li>
          <li>决策: 精力充沛, 富有上进心, 可有作为. 但务必勤勉努力, 诚心诚恳, 奋发向上, 刻苦钻研. 不可因小有成就而得意忘形. 不必追求所得, 而应追求实干. 遵循规律办事, 等待时机再行动. 尤其应清除非份的念头. 这样, 可实现自己的理想. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 57)  }">
      <h2>山天大畜(xù) 艮上乾下</h2>
      <div class='guaci'>
        大畜: 利贞, 不家食吉, 利涉大川. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 有厉利已. 
          </li>
          <li>九二: 舆说輹. 
          </li>
          <li>九三: 良马逐, 利艰贞.  曰闲舆卫, 利有攸往. 
          </li>
          <li>六四: 童牛之牿, 元吉. 
          </li>
          <li>六五: 豶豕之牙, 吉. 
          </li>
          <li>上九: 何天之衢, 亨. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 大畜, 刚健笃实, 辉光日新其德, 刚上而尚贤.  能止健, 大正也. 
        不家食吉, 养贤也.  利涉大川, 应乎天也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 天在山中, 大畜；君子以多识前言往行, 以畜其德. 
        有厉利已, 不犯灾也. 
        舆说輹, 中无尤也. 
        利有攸往, 上合志也. 
        六四元吉, 有喜也. 
        六五之吉, 有庆也. 
        何天之衢, 道大行也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 忧愁常锁两眉头, 千头万绪挂心间, 从今以后防开阵, 任意行而不相干. </li>
          <li>这个卦是异卦（下乾上艮）相叠. 乾为天, 刚健；艮为山, 笃实. 畜者积聚, 大畜意为大积蓄. 为此不畏严重的艰难险阻, 努力修身养性以丰富德业. </li>
          <li>事业: 务必端正行为, 滋养德行. 行为应大胆, 果断, 但需适可而止, 注意休整, 决不可冒险闯进. 宜注意吸收前人的经验教训, 有所畏而不行, 否则必有危害. 再取得成就之后, 应适可而止, 不可贪图眼前小利而走向反面. </li>
          <li>经商: 本着循序渐进的原则, 把握正当的商业道德, 会有重大收获. 此时, 切忌贪心不足, 而应见机而退, 保守事业, 深思熟虑, 再图发展, 一味自信冒进, 决不可取. </li>
          <li>求名: 注意积累学问, 提高德行, 勿三天打鱼两天晒网, 持之以恒, 且以学问、知识报效国家, 抱负终将实现. </li>
          <li>外出: 不宜守于家中, 出行必得, 且畅通无阻. 不过应处处小心谨慎. </li>
          <li>婚恋: 顺利. 建立在共同勤俭持家的基础上, 相互坦诚而待, 美满幸福. </li>
          <li>决策: 蓄财的人, 但决不可抱投机取巧心理, 得靠个人诚实工作, 多动心机, 真诚与他人合作, 共创事业, 困难时仍应持正道, 尤其不可粗心大意, 牢记成就大阻力也大的道理. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 33)  }">
      <h2>山雷颐 艮上震下</h2>
      <div class='guaci'>
        颐: 贞吉.  观颐, 自求口实. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 舍尔灵龟, 观我朵颐, 凶. 
          </li>
          <li>六二: 颠颐, 拂经, 于丘颐, 征凶. 
          </li>
          <li>六三: 拂颐, 贞凶, 十年勿用, 无攸利. 
          </li>
          <li>六四: 颠颐吉, 虎视眈眈, 其欲逐逐, 无咎. 
          </li>
          <li>六五: 拂经, 居贞吉, 不可涉大川. 
          </li>
          <li>上九: 由颐, 厉吉, 利涉大川. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 颐贞吉, 养正则吉也.  观颐, 观其所养也； 自求口实, 观其自养
        也.  天地养万物, 圣人养贤, 以及万民；颐之时大矣哉！
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 山下有雷, 颐；君子以慎言语, 节饮食. 
        观我朵颐, 亦不足贵也. 
        六二征凶, 行失类也. 
        十年勿用, 道大悖也. 
        颠颐之吉, 上施光也. 
        居贞之吉, 顺以从上也. 
        由颐厉吉, 大有庆也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 太公独钓渭水河, 手执丝杆忧愁多, 时来又遇文王访, 自此永不受折磨. </li>
          <li>这个卦是异卦（下震上艮）相叠. 震为雷, 艮为山. 山在上而雷在下, 外实内虚. 春暖万物养育, 依时养贤育民. 阳实阴虚, 实者养人, 虚者为人养. 自食其力. </li>
          <li>事业: 凡事得靠个人追求, 自己奋斗, 而不能依赖他人. 更不得用不光彩的手段谋求财物. 只要遵循正道, 自食其力, 慎言敏行, 一定会有好的机遇. 这时, 经过一番艰苦奋斗, 能够成功. </li>
          <li>经商: 不得急于求成, 初仅以勉强维持生活为限. 谨慎小心, 循序渐进, 诚以待人, 真诚与他人合作, 因时制宜, 不断追求新的开拓方向, 必要时可适当冒险. </li>
          <li>求名: 以丰富自身知识为目的, 知足安贫, 刻苦努力, 成功的希望极大. </li>
          <li>外出: 应慎重, 不宜过多外出. 如无充分准备, 仓促出行, 将可能会遇到凶险. </li>
          <li>婚恋: 不可急于求成. 关键在于加强自己的修养. 一旦选中应全力追求, 尤其不可三心二意. </li>
          <li>决策: 注意道德修养, 乐于尽力而为地去帮助他人, 救人急难, 不贪求不应得到的财物. 因此, 能受到他人的尊重, 也能不断得到外来的援助, 个人事业十分顺利, 成功的可能性很大. 尤其不可粗心大意, 牢记成就大阻力也大的道理. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 30)  }">
      <h2>泽风大过 兑上巽下</h2>
      <div class='guaci'>
        大过: 栋桡, 利有攸往, 亨. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 藉用白茅, 无咎. 
          </li>
          <li>九二: 枯杨生稊, 老夫得其女妻, 无不利. 
          </li>
          <li>九三: 栋桡, 凶. 
          </li>
          <li>九四: 栋隆, 吉；有它吝. 
          </li>
          <li>九五: 枯杨生华, 老妇得士夫, 无咎无誉. 
          </li>
          <li>上六: 过涉灭顶, 凶, 无咎. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 大过, 大者过也.  栋桡, 本末弱也.  刚过而中, 巽而说行, 利有
        攸往, 乃亨.  大过之时义大矣哉！
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 泽灭木, 大过；君子以独立不惧, 遯世无闷. 
        藉用白茅, 柔在下也. 
        老夫女妻, 过以相与也. 
        栋桡之凶, 不可以有辅也. 
        栋隆之吉, 不桡乎下也. 
        枯杨生华, 何可久也.  老妇士夫, 亦可丑也. 
        过涉之凶, 不可咎也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 夜晚梦里梦金银, 醒来仍不见一文, 目下只宜求本分, 思想络是空劳神. </li>
          <li>这个卦是异卦（下巽上兑）相叠. 兑为泽、为悦, 巽为木、为顺, 泽水淹舟, 遂成大错. 阴阳爻相反, 阳大阴小, 行动非常, 有过度形象, 内刚外柔. </li>
          <li>事业: 事业出现隐患, 甚至危机四伏, 务必十分小心谨慎, 唯有坚守中道, 以谦虚和悦的手段, 胆大心细, 求助他人相助. 必要时可采取非常手段, 不拘常规, 予以冒险. </li>
          <li>经商: 操之过急, 发展过快, 宜收缩调整. 竞争处于不利地步, 切勿过度自信, 更不得刚愎自用, 宜随时观测风向, 待机行动. 在有确切把握之下, 不妨冒险, 争取时机的好转. </li>
          <li>求名: 最忌不务实际, 追求不切实际的虚名, 以致盛名不符. 唯以谦逊态度, 谨慎行动, 潜心努力, 不怕世人指现, 一往直前, 追求最初的目标. </li>
          <li>外出: 行动务必慎重, 但不可过于拘泥, 必要时不妨采取特殊行动. </li>
          <li>婚恋: 自知之明最为重要, 不可急于求成, 应慎重考虑, 并以正当手段, 促成事情的成功. 但也不排除必要的精明手段. </li>
          <li>决策: 处在非常时期, 若不能妥善处置, 则极为不利, 针对实际情况, 既不可轻举妄动, 也不可优柔寡断, 而应刚柔相济, 虚心征求他人意见, 慎重行动, 大胆追求, 却又不怕流言, 争取时局好转. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 18)  }">
      <h2>坎为水 坎上坎下</h2>
      <div class='guaci'>
        坎: 习坎, 有孚, 维心亨, 行有尚. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 习坎, 入于坎窞, 凶. 
          </li>
          <li>九二: 坎有险, 求小得. 
          </li>
          <li>六三: 来之坎坎, 险且枕, 入于坎窞, 勿用. 
          </li>
          <li>六四: 樽酒簋贰, 用缶, 纳约自牖, 终无咎. 
          </li>
          <li>九五: 坎不盈, 祗既平, 无咎. 
          </li>
          <li>上六: 系用徽纆, 置于丛棘, 三岁不得, 凶. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 习坎, 重险也.  水流而不盈, 行险而不失其信.  维心亨, 乃以刚中也.  行有尚, 
        往有功也.  天险不可升也, 地险山川丘陵也, 王公设险以守其国, 险之时用大矣哉！
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 水洊至, 习坎；君子以常德行, 习教事. 
        习坎入坎, 失道凶也. 
        求小得, 未出中也. 
        来之坎坎, 终无功也. 
        樽酒簋贰, 刚柔际也. 
        坎不盈, 中未大也. 
        上六失道, 凶三岁也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 一轮明月照水中, 只见影儿不见踪, 愚夫当财下去取, 摸来摸去一场空. </li>
          <li>这个卦是同卦（下坎上坎）相叠. 坎为水、为险, 两坎相重, 险上加险, 险阻重重. 一阳陷二阴. 所幸阴虚阳实, 诚信可豁然贯通. 虽险难重重, 却方能显人性光彩. </li>
          <li>事业: 陷入重重艰难险阻之中, 险况丛生. 既不得冒险, 也不可束手待毙, 应以积极态度, 努力创造条件, 改变处境, 化险为夷. 务必实心实意, 充满信心, 不图侥幸, 不辞艰险, 宜静观待变, 运用智慧, 突破险境, 转危为安. </li>
          <li>经商: 十分不利, 甚至陷入面临破产的境地, 但内心应沉着踏实, 保持头脑冷静, 身陷险境而心不陷, 勿轻举妄动, 先求自保以观变, 把握时机以脱险. </li>
          <li>求名: 不为他人理解, 怀才不遇. 不可自暴自弃. 不改初衷, 泰然自若, 循序渐进, 终可为人理解和发现. </li>
          <li>外出: 大胆外出, 另辟新路, 必有所成, 且得到他人相助. </li>
          <li>婚恋: 多遭不利, 应冷静分析原因, 积极改变自身条件. 双方同舟共济, 共渡难关. </li>
          <li>决策: 不幸. 然而是转运前的考验. 只要能不因困境而失常, 且不图侥幸, 保持信心, 勿自陷险境. 镇定自若, 不轻举妄动, 洞察时机, 必可转危为安, 成出险之功. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 45)  }">
      <h2>离为火 离上离下</h2>
      <div class='guaci'>
        离: 利贞, 亨.  畜牝牛, 吉. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 履错然, 敬之无咎. 
          </li>
          <li>六二: 黄离, 元吉. 
          </li>
          <li>九三: 日昃之离, 不鼓缶而歌, 则大耋之嗟, 凶. 
          </li>
          <li>九四: 突如其来如, 焚如, 死如, 弃如. 
          </li>
          <li>六五: 出涕沱若, 戚嗟若, 吉. 
          </li>
          <li>上九: 王用出征, 有嘉折首, 获匪其丑, 无咎. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 离, 丽也；日月丽乎天, 百谷草木丽乎土, 重明以丽乎正, 乃化成
        天下.  柔丽乎中正, 故亨；是以畜牝牛吉也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 明两作离, 大人以继明照于四方. 
        履错之敬, 以辟咎也. 
        黄离元吉, 得中道也. 
        日昃之离, 何可久也. 
        突如其来如, 无所容也. 
        六五之吉, 离王公也. 
        王用出征, 以正邦也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 官人来占主高升, 庄农人家产业增, 生意买卖利息厚, 匠艺占之大亨通. </li>
          <li>这个卦是同卦（下离上离）相叠. 离者丽也, 附着之意, 一阴附丽, 上下二阳, 该卦象征火, 内空外明. 离为火、为明、太阳反复升落, 运行不息, 柔顺为心. </li>
          <li>事业: 已快进入顶点, 盛极而衰, 务必总结经验教训, 趋善避邪, 以顺自养, 居危知危, 激励志气, 切勿妄动. 尤应求助中正的人援助, 以期重振事业. </li>
          <li>经商: 戒急于求成, 宜兢兢业业, 忧深虑远, 考察市场行情, 公平竞争, 不可投机取巧. 争取与他人密切合作. </li>
          <li>求名: 方向未确定之前, 不可到处乱撞, 应持之以恒, 执意追求, 虚心向有才德的长者请教. </li>
          <li>外出: 可行动, 事先应准备充分, 不可仓促上路. </li>
          <li>婚恋: 自己寻找对象恐怕有困难, 最好请可靠的朋友、长辈帮忙, 不得急躁. 双方应相互尊敬, 最忌生邪念. </li>
          <li>决策: 乐天知命, 顺应自然, 年轻时急于上进, 未能实现理想, 但坚持中正、谦和, 可无灾祸, 时常警觉, 更可化险为夷. 在危难时要寻求依托, 但要慎重选择对象. 晚年应知天命, 尤不可不顾时势而轻举妄图动. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 14)  }">
      <h2>泽山咸 兑上艮下</h2>
      <div class='guaci'>
        咸: 亨, 利贞, 取女吉. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 咸其拇. 
          </li>
          <li>六二: 咸其腓, 凶, 居吉. 
          </li>
          <li>九三: 咸其股, 执其随, 往吝. 
          </li>
          <li>九四: 贞吉悔亡, 憧憧往来, 朋从尔思. 
          </li>
          <li>九五: 咸其脢, 无悔. 
          </li>
          <li>上六: 咸其辅, 颊, 舌. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 咸, 感也. 柔上而刚下, 二气感应以相与, 止而说, 男下女, 是以
        亨利贞, 取女吉也. 天地感而万物化生, 圣人感人心而天下和平；
        观其所感, 而天地万物之情可见矣！
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 山上有泽, 咸；君子以虚受人. 
        咸其拇, 志在外也. 
        虽凶, 居吉, 顺不害也. 
        咸其股, 亦不处也.  志在随人, 所执下也. 
        贞吉悔亡, 未感害也.  憧憧往来, 未光大也. 
        咸其脢, 志末也. 
        咸其辅, 颊, 舌, 滕口说也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 运去黄金失色, 时来棒槌发芽, 月令极好无差, 且喜心宽意大. </li>
          <li>这个卦是异卦（下艮上兑）相叠. 艮为山；泽为水. 兑柔在上, 艮刚在下, 水向下渗, 柔上而刚下, 交相感应. 感则成. </li>
          <li>事业: 和为贵, 和则万事兴, 务以诚感人, 以诚待人. 广泛交往朋友, 谦虚礼让. 树立大志向, 坚持主见, 不可盲目随大流. 不利时应安居待机, 不可妄动强求. </li>
          <li>经商: 有利可图. 但应以纯正之心, 以诚待人, 加强合作. 市场若不景气, 决不可妄动, 不可强求, 而应静待发展. 虚心听取不同意见. </li>
          <li>求名: 志向应宏大, 脚踏实地, 虚心请教他人, 使人悦而应, 帮助、重用自己. 切莫自我封闭, 更不得冷漠孤僻, 以广阔的胸怀发展自身. </li>
          <li>外出: 虽希望外出, 但暂时不宜远行. 待时机成熟时再出行. </li>
          <li>婚恋: 成功的可能性极大. 双方很有感情, 但动机务要纯正, 婚姻方可幸福、永久. </li>
          <li>决策: 吉祥如意. 人际关系好, 善于交际. 以真诚的态度, 无私的心去处世, 不会有不利的地方. 与他人合作应坚持原则. 办事不可优柔寡断. 不顺利时, 应停止行动, 总结经验, 以图发展. 待人诚恳, 但不可与玩弄口舌的小人交往, 防止受骗. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 28)  }">
      <h2>雷风恒 震上巽下</h2>
      <div class='guaci'>
        恒: 亨, 无咎, 利贞, 利有攸往. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 浚恒, 贞凶, 无攸利. 
          </li>
          <li>九二: 悔亡. 
          </li>
          <li>九三: 不恒其德, 或承之羞, 贞吝. 
          </li>
          <li>九四: 田无禽. 
          </li>
          <li>六五: 恒其德, 贞, 妇人吉, 夫子凶. 
          </li>
          <li>上六: 振恒, 凶. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 恒, 久也.  刚上而柔下, 雷风相与, 巽而动, 刚柔皆应, 恒.  恒
        亨无咎, 利贞； 久於其道也, 天地之道, 恒久而不已也.  利有攸
        往, 终则有始也. 日月得天, 而能久照, 四时变化, 而能久成, 圣
        人久於其道, 而天下化成；观其所恒, 而天地万物之情可见矣！
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 雷风, 恒；君子以立不易方. 
        浚恒之凶, 始求深也. 
        九二悔亡, 能久中也. 
        不恒其德, 无所容也. 
        久非其位, 安得禽也. 
        妇人贞吉, 从一而终也.  夫子制义, 从妇凶也. 
        振恒在上, 大无功也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 鱼翁寻鱼运气好, 鱼来撞网跑不了, 别人使本挣不来, 谁想一到就凑和. </li>
          <li>这个卦是异卦（下巽上震）相叠. 震为男、为雷；巽为女、为风. 震刚在上, 巽柔在下. 刚上柔下, 造化有常, 相互助长. 阴阳相应, 常情, 故称为恒. </li>
          <li>事业: 诸事无不成于恒, 持之以恒, 必有成效. 恒乃成功之本. 为此, 务必动机纯正, 守静而勿躁动, 不可急于求成, 也不可固守死道, 应从个人实际出发. 最忌人云亦云, 最宜随机应变. 如此, 诸事顺而成. </li>
          <li>经商: 大胆行动, 有所往必有所利. 注意市场行情和周围的情况. 随时变化经营策略, 但不得改变常理常道, 坚持慎重选择的方向, 勿追随潮流. 忌不自量而冒险强求. </li>
          <li>求名: 有始有终, 善始善终, 立于正道, 坚持不懈, 学习方面尤应提高涵养, 必可成. </li>
          <li>外出: 果敢行动, 有利. </li>
          <li>婚恋: 好事多磨, 有曲折, 唯不可见异思迁, 和睦相处, 勿固执己见. </li>
          <li>决策: 循序渐进, 不得在一开始期望过高, 但不得因此放弃追求, 应脚踏实地, 从实际也发, 不要好高骛远, 更不可不自量, 勿冒险激进, 勿反复无常. 坚信宇宙常新, 不断修正自己的见解, 补充新内容. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 15)  }">
      <h2>天山遁(dùn) 乾上艮下</h2>
      <div class='guaci'>
        遁: 亨, 小利贞. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 遁尾, 厉, 勿用有攸往. 
          </li>
          <li>六二: 执之用黄牛之革, 莫之胜说. 
          </li>
          <li>九三: 系遁, 有疾厉, 畜臣妾吉. 
          </li>
          <li>九四: 好遁君子吉, 小人否. 
          </li>
          <li>九五: 嘉遁, 贞吉. 
          </li>
          <li>上九: 肥遁, 无不利. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 遁亨, 遁而亨也.  刚当位而应, 与时行也.  小利贞, 浸而长也. 
        遁之时义大矣哉！
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 天下有山, 遁；君子以远小人, 不恶而严. 
        遁尾之厉, 不往何灾也. 
        执用黄牛, 固志也. 
        系遁之厉, 有疾惫也.  畜臣妾吉, 不可大事也. 
        君子好遁, 小人否也. 
        嘉遁贞吉, 以正志也. 
        肥遁, 无不利；无所疑也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 浓云蔽日不光明, 劝君且莫出远行, 婚姻求财皆不利, 提防口舌到门庭. </li>
          <li>这个卦是异卦（下艮上乾）相叠. 乾为天, 艮为山. 天下有山, 山高天退. 阴长阳消, 小人得势, 君子退隐, 明哲保身, 伺机救天下. </li>
          <li>事业: 时运不佳, 应考虑退隐, 勿与不正派的人同流合污. 但不是消极逃避, 而是为保存实力, 总结经验, 把握时机, 待机而出. 切忌贸然行事, 造成不必要的损失. 同时勿为眼前小利禄所诱惑. </li>
          <li>经商: 市场进入衰落的状况, 行情不佳. 决不可执意追求, 盲目投入, 而应沉着冷静, 坚持商业道德, 远离小人、奸商, 保存自己的实力, 等待市场行情好转, 再图发展. </li>
          <li>求名: 宜暂名哲保身, 甘居退隐. 全力总结提高, 为复出做准备. </li>
          <li>外出: 不宜积极行动, 而应等待时机, 创造条件, 争取早日而行. </li>
          <li>婚恋: 勿急于解决, 更不可妄动强求. 时机成熟时, 须以纯正的态度去正确对待. </li>
          <li>决策: 处于衰败时期, 小人得志. 盲目行动必遭不利. 虽不必以恶报恶, 但更不可同流合污, 因小失大, 因权宜轻重, 韬光养晦, 保存实力, 断然离去, 不可犹豫不决. 潜心发展个人实力, 隐忍待机. 只要能坚定正道, 坚持中正, 必可在时机成熟时复出, 成就大业. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 60)  }">
      <h2>雷天大壮 震上乾下</h2>
      <div class='guaci'>
        大壮: 利贞. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 壮于趾, 征凶, 有孚. 
          </li>
          <li>九二: 贞吉. 
          </li>
          <li>九三: 小人用壮, 君子用罔, 贞厉.  羝羊触藩, 羸其角. 
          </li>
          <li>九四: 贞吉悔亡, 藩决不羸, 壮于大舆之輹. 
          </li>
          <li>六五: 丧羊于易, 无悔. 
          </li>
          <li>上六: 羝羊触藩, 不能退, 不能遂, 无攸利, 艰则吉. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 大壮, 大者壮也.  刚以动, 故壮.  大壮利贞；大者正也. 正大而
        天地之情可见矣！
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 雷在天上, 大壮；君子以非礼弗履. 
        壮于趾, 其孚穷也. 
        九二贞吉, 以中也. 
        小人用壮, 君子罔也. 
        藩决不羸, 尚往也. 
        丧羊于易, 位不当也. 
        不能退, 不能遂, 不祥也.  艰则吉, 咎不长也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 卦占工师得大木, 眼前该着走上路, 时来运转多顺当, 有事自管放心宽. </li>
          <li>这个卦是异卦（下乾上震）相叠. 震为雷；乾为天. 乾刚震动. 天鸣雷, 云雷滚, 声势宏大, 阳气盛壮, 万物生长. 刚壮有力故曰壮. 大而且壮, 故名大壮. 四阳壮盛, 积极而有所作为, 上正下正, 标正影直. </li>
          <li>事业: 处世凭智不凭力, 有勇更有谋, 切忌蛮干, 该守不守, 自取其凶. 不可逞强, 否则自取凶险. 对小人应有防犯, 尤其不得忽视小人的奸诈. 对事业应勇往直前, 但切忌冒进. </li>
          <li>经商: 处在高涨阶段, 形势很好. 但决不可逞强, 更不可妄动, 应主动增强与他人的合作. 提高警惕, 认识物极必反的道理, 做事业衰退的准备. </li>
          <li>求名: 务必注意妥善地运用自己的力量, 不可自恃刚健强壮而冒进. 尤其不可自负. 适当发挥自己的才干, 加上外力的援助, 必有所作为. </li>
          <li>外出: 慎重外出, 不可莽撞, 否则不吉利. </li>
          <li>婚恋: 决不可因自己条件好而高傲. 切勿错过好姻缘. </li>
          <li>决策: 强健适中, 不可过分消耗自己的力量. 在事业顺利的时刻, 尤其不可妄动. 更应注意, 很可能已经处于进退维谷的状态, 务必自保待机, 及早有所准备. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 5)  }">
      <h2>火地晋 离上坤下</h2>
      <div class='guaci'>
        晋: 康侯用锡马蕃庶, 昼日三接. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 晋如, 摧如, 贞吉.  罔孚, 裕无咎. 
          </li>
          <li>六二: 晋如, 愁如, 贞吉.  受兹介福, 于其王母. 
          </li>
          <li>六三: 众允, 悔亡. 
          </li>
          <li>九四: 晋如鼫鼠, 贞厉. 
          </li>
          <li>六五: 悔亡, 失得勿恤, 往吉无不利. 
          </li>
          <li>上九: 晋其角, 维用伐邑, 厉吉无咎, 贞吝. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 晋, 进也.  明出地上, 顺而丽乎大明, 柔进而上行.  是以康侯用
        锡马蕃庶, 昼日三接也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 明出地上, 晋；君子以自昭明德. 
        晋如, 摧如；独行正也.  裕无咎；未受命也. 
        受之介福, 以中正也. 
        众允之, 志上行也. 
        鼫鼠贞厉, 位不当也. 
        失得勿恤, 往有庆也. 
        维用伐邑, 道未光也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
      <ul>
        <li>象曰: 锄地锄去苗里草, 谁想财帛将人找, 一锄锄出银子来, 这个运气也算好. </li>
        <li>这个卦是异卦（下坤上离）相叠. 离为日, 为光明；坤为地. 太阳高悬, 普照大地, 大地卑顺, 万物生长, 光明磊落, 柔进上行, 喻事业蒸蒸日上. </li>
        <li>事业: 顺利. 应遵守正道, 迎难而上, 克敌制胜, 因势利导. 树立良好的人际关系, 深得人心. 全力以赴, 不得有丝毫犹豫不决, 更忌优柔寡断, 而应败不馁, 勇往直前. 注意和衷共济, 共同前进. </li>
        <li>经商: 行情好. 市场竞争顺利. 但也会遇到一些困难, 必迎难而上, 因势利导, 克敌制胜. 争取众人支持. 前进中的挫折不可免, 只要动机纯正, 必可转危为安. </li>
        <li>求名: 经刻苦努力与奋斗, 已具备开拓事业的基础, 却因无人引荐, 暂时不得志, 决不可因此自暴自弃, 须耐心等待时机. 同时, 更加积极地创造条件. </li>
        <li>外出: 克服犹豫心理, 大胆前进, 可无往而不顺. </li>
        <li>婚恋: 吉星高照. 会有理想的结果, 但决不可自恃条件优越而抱无所谓的态度或过于挑剔. </li>
        <li>决策: 处于不断上升的形势, 不会有过大的阻力. 但务必争取众人信任, 获取人心, 再接再厉, 只要动机纯正, 克服侥幸心理, 必有喜从天降. </li>
      </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 40)  }">
      <h2>地火明夷 坤上离下</h2>
      <div class='guaci'>
        明夷: 利艰贞. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 明夷于飞, 垂其翼.  君子于行, 三日不食,  有攸往, 主人有言. 
          </li>
          <li>六二: 明夷, 夷于左股, 用拯马壮, 吉. 
          </li>
          <li>九三: 明夷于南狩, 得其大首, 不可疾贞. 
          </li>
          <li>六四: 入于左腹, 获明夷之心, 于出门庭. 
          </li>
          <li>六五: 箕子之明夷, 利贞. 
          </li>
          <li>上六: 不明晦, 初登于天, 后入于地. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 明入地中, 明夷.  内文明而外柔顺, 以蒙大难, 文王以之.  利艰
        贞, 晦其明也, 内难而能正其志, 箕子以之. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 明入地中, 明夷；君子以莅众, 用晦而明. 
        君子于行, 义不食也. 
        六二之吉, 顺以则也. 
        南狩之志, 乃大得也. 
        入于左腹, 获心意也. 
        箕子之贞, 明不可息也. 
        初登于天, 照四国也.  后入于地, 失则也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 时乖运拙走不着, 急忙过河拆了桥, 恩人无义反为怨, 凡事无功枉受劳. </li>
          <li>这个卦是异卦（下离上坤）相叠. 离为明, 坤为顺；离为日；坤为地. 日没入地, 光明受损, 前途不明, 环境困难, 宜遵时养晦, 坚守正道, 外愚内慧, 韬光养晦. </li>
          <li>事业: 处于不利的环境, 宜心境坦然地处置险恶的条件, 增强心理素质, 承受各种压力. 表面柔顺小心, 内心洞察事理, 当离去则离去, 避免灾祸, 脱离危险. 防患于未然, 坚持逆境中奋斗. </li>
          <li>经商: 认真观察言市场动态, 待机行动, 但须坚持商业道德, 即使处于不利情况下, 也要冒险向前, 特别是要向南方发展, 会大有收获. </li>
          <li>求名: 内心保持大志, 行动刻苦忍耐, 奋斗于逆境, 自守其志, 收敛聪明而不外露, 于混乱中更应坚持正义, 藏拙守愚. </li>
          <li>外出: 最好不要马上行动, 再等待一个时期, 做好充分准备. </li>
          <li>婚恋: 必须全面分析对方情况, 不能因小失大. 注意大节. </li>
          <li>决策: 处在不佳的状况下, 环境困难, 前途不明. 但若能坦处厄运, 能伸能屈, 前景会变光明. 尤其应加强修养, 隐忍行志, 外愚内慧, 可以遇难呈祥. 如能谨慎行事, 处处小心, 更能有所作为. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 43)  }">
      <h2>风火家人 巽上离下</h2>
      <div class='guaci'>
        家人: 利女贞. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 闲有家, 悔亡. 
          </li>
          <li>六二: 无攸遂, 在中馈, 贞吉. 
          </li>
          <li>九三: 家人嗃嗃, 悔厉吉；妇子嘻嘻, 终吝. 
          </li>
          <li>六四: 富家, 大吉. 
          </li>
          <li>九五: 王假有家, 勿恤吉. 
          </li>
          <li>上九: 有孚威如, 终吉. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 家人, 女正位乎内, 男正位乎外, 男女正, 天地之大义也. 家人有严君焉, 
        父母之谓也. 父父, 子子, 兄兄, 弟弟, 夫夫, 妇妇, 而家道正；正家而天下定矣. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 风自火出, 家人；君子以言有物, 而行有恒. 
        闲有家, 志未变也. 
        六二之吉, 顺以巽也. 
        家人嗃嗃, 未失也；妇子嘻嘻, 失家节也. 
        富家大吉, 顺在位也. 
        王假有家, 交相爱也. 
        威如之吉, 反身之谓也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 一朵鲜花镜中开, 看着极好取不来, 劝君休把镜花恋, 卦若逢之主可怪. </li>
          <li>这个卦是异卦（下离上巽）相叠. 离为火；巽为风. 火使热气上升, 成为风. 一切事物皆应以内在为本, 然后伸延到外. 发生于内, 形成于外. 喻先治家而后治天下, 家道正, 天下安乐. </li>
          <li>事业: 成功与否取决于家庭的情况. 严格治家, 防止"后院"起火出现意外事故, 这是事业成功的先决条件. 夫妇和睦, 共同合作, 必可脱贫致富. 事业应由内而外, 循序渐进, 持之以恒, 而后必有所成. </li>
          <li>经商: 以治家方式用于商业活动. 对待公司职工应严宽结合, 以严为主. 宜集中领导, 主事一人, 共同合作, 日积月累. </li>
          <li>求名: 以勤苦努力和安贫乐道为主, 更应有家庭的支持. 家道兴盛的同时, 个人的事业也就容易成功. </li>
          <li>外出: 在家千日好, 外出一时难, 准备充分后再行动. </li>
          <li>婚恋: 和睦的家庭, 是一切的基础, 而妻子又是家道的根本. 择妻应慎重, 和乐兴家. 担</li>
          <li>决策: 因好的家庭和妻子的支持而顺利成功, 务必保持这种优势, 否则, 由盛转衰在顷刻之间. 尤其应预防家庭变故. 持家重在谦和待人, 勤俭积蓄以致富. 亲人相互和睦、友好. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 53)  }">
      <h2>火泽睽(kuí) 离上兑下</h2>
      <div class='guaci'>
        睽: 小事吉. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 悔亡, 丧马勿逐, 自复；见恶人无咎. 
          </li>
          <li>九二: 遇主于巷, 无咎. 
          </li>
          <li>六三: 见舆曳, 其牛掣, 其人天且劓, 无初有终. 
          </li>
          <li>九四: 睽孤, 遇元夫, 交孚, 厉无咎. 
          </li>
          <li>六五: 悔亡, 厥宗噬肤, 往何咎. 
          </li>
          <li>上九: 睽孤,  见豕负涂, 载鬼一车,  先张之弧, 后说之弧, 匪寇婚媾, 往遇雨则吉. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 睽, 火动而上, 泽动而下； 二女同居, 其志不同行；说而丽乎明, 
        柔进而上行, 得中而应乎刚；是以小事吉.  天地睽, 而其事同也；
        男女睽, 而其志通也；万物睽, 而其事类也；睽之时用大矣哉！
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 上火下泽, 睽；君子以同而异. 
        见恶人, 以辟咎也. 
        遇主于巷, 未失道也. 
        见舆曳, 位不当也.  无初有终, 遇刚也. 
        交孚无咎, 志行也. 
        厥宗噬肤, 往有庆也. 
        遇雨之吉, 群疑亡也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 此卦占来运气歹, 如同太公作买卖, 贩猪牛快贩羊迟, 猪羊齐贩断了宰. </li>
          <li>这个卦是异卦（下兑上离）相叠. 离为火；兑为泽. 上火下泽, 相违不相济. 克则生, 往复无空. 万物有所不同, 必有所异, 相互矛盾. 睽即矛盾. </li>
          <li>事业: 事业开创困难, 处境艰辛. 如能志同道合, 相互信任, 目的可以达到. 但起初成功的多是小事. 小事积累可成大事. 事成于协力合作, 败于众志相异. 应加强团结, 委曲以求相通. 最忌内部相互猜疑. </li>
          <li>经商: 应以心平气和的态度投入市场竞争, 求大同而存小异. 对竞争对手不应敌视, 可和而不流, 群而不党. 尤其不能惹起纠纷, 极力避免灾祸. </li>
          <li>求名: 以真诚的心努力上进. 对于恶人必要时亦不可完全不交往, 应采取宽大包容的态度, 适度往来. 对志同道合者也不必完全一致, 可异中求同. </li>
          <li>外出: 顺利. 途中可以得到善人相助. </li>
          <li>婚恋: 双方必真诚相待. 否则, 第三者极易介入, 夫妻相疑则家破. </li>
          <li>决策: 处于矛盾、对应状态. 必须注意以宽宏大度、平和、柔顺的态度对待人生. 这样才能心平气和, 柔而上进. 认清合必有离, 离必有合；同中有异, 异中有同的道理. 否则, 刚极暴躁, 明极生疑. 暴疑皆可致命. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 10)  }">
      <h2>水山蹇(jiǎn) 坎上艮下</h2>
      <div class='guaci'>
        蹇: 利西南, 不利东北；利见大人, 贞吉. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 往蹇, 来誉. 
          </li>
          <li>六二: 王臣蹇蹇, 匪躬之故. 
          </li>
          <li>九三: 往蹇来反. 
          </li>
          <li>六四: 往蹇来连. 
          </li>
          <li>九五: 大蹇朋来. 
          </li>
          <li>上六: 往蹇来硕, 吉；利见大人. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 蹇, 难也, 险在前也.  见险而能止, 知矣哉！蹇利西南,  往得中
        也；不利东北, 其道穷也.  利见大人, 往有功也.  当位贞吉, 以
        正邦也.  蹇之时用大矣哉！
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 山上有水, 蹇；君子以反身修德. 
        往蹇来誉, 宜待也. 
        王臣蹇蹇, 终无尤也. 
        往蹇来反, 内喜之也. 
        往蹇来连, 当位实也. 
        大蹇朋来, 以中节也. 
        往蹇来硕, 志在内也.  利见大人, 以从贵也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 大雨倾地雪满天, 路上行人苦又寒, 拖泥带水费尽力, 事不遂心且耐烦. </li>
          <li>这个卦是异卦（下艮上坎）相叠. 坎为水, 艮为山. 山高水深, 困难重重, 人生险阻, 见险而止, 明哲保身, 可谓智慧. 蹇, 跋行艰难. </li>
          <li>事业: 诸事开头难, 坚持下去, 会有好的结果. 人生不易, 首先得求诸自己, 修德养性. 志高自信, 奋勇进取. 逢到困难, 得求友人相助, 行动不可冒险, 必以柔克刚, 待机候时, 量力而行. </li>
          <li>经商: 逐步起业, 冒险行事, 自寻苦恼. 宜加强商业道德, 真诚同他人合作, 陷入困境时, 不得见死不救, 而应奋不顾身. 联合行动, 可活跃于市场竞争之中. </li>
          <li>求名: 循序渐进, 加强自身修道. 居静观动, 待变, 俟机而动, 能进则进. 内心坦然, 不可为追逐名利而冒险. 与贤能结合, 追随高人, 必能转危为安. </li>
          <li>外出: 出门可能有难, 利于西南行. 如外出遇难, 可得救助, 转危为安. </li>
          <li>婚恋: 不很顺利, 不得急, 宜慎重选择. 但应有自知之明. </li>
          <li>决策: 艰难不利. 但可视为考验. 奋进向前, 充满信心, 切勿自寻苦恼, 交结贤人, 相互帮助, 坚守中正之道, 可遇难呈祥, 结得善果. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 20)  }">
      <h2>雷水解(xiè) 震上坎下</h2>
      <div class='guaci'>
        解: 利西南, 无所往, 其来复吉.  有攸往, 夙吉. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 无咎. 
          </li>
          <li>九二: 田获三狐, 得黄矢, 贞吉. 
          </li>
          <li>六三: 负且乘, 致寇至, 贞吝. 
          </li>
          <li>九四: 解而拇, 朋至斯孚. 
          </li>
          <li>六五: 君子维有解, 吉；有孚于小人. 
          </li>
          <li>上六: 公用射隼, 于高墉之上, 获之, 无不利. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 解, 险以动, 动而免乎险, 解.  解利西南, 往得众也. 其来复吉, 
        乃得中也. 有攸往夙吉, 往有功也.  天地解, 而雷雨作, 雷雨作, 
        而百果草木皆甲坼, 解之时大矣哉！
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 雷雨作, 解；君子以赦过宥罪. 
        刚柔之际, 义无咎也. 
        九二贞吉, 得中道也. 
        负且乘, 亦可丑也, 自我致戎, 又谁咎也. 
        解而拇, 未当位也. 
        君子有解, 小人退也. 
        公用射隼, 以解悖也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 目下月令如过关, 千辛万苦受熬煎, 时来恰相有人救, 任意所为不相干. </li>
          <li>这个卦是异卦（下坎上震）相叠. 震为雷、为动；坎为水、为险. 险在内, 动在外. 严冬天地闭塞, 静极而动. 万象更新, 冬去春来, 一切消除, 是为解. </li>
          <li>事业: 元气初复, 宜休养生息, 安静平易为佳, 宜宽宜和. 当准备就绪则应立即行动, 争取主动, 不可拖廷, 所往必有功利. 但切勿贪得无厌. 克勤克俭, 刚柔相济, 以柔为主. 远辟小人, 团结君子, 相互依托, 共成事业. </li>
          <li>经商: 行动贵神速, 积极而为, 方可摆脱险境. 行商宜循正道, 切勿招摇过市. 此乃愚蠢行动, 必自招灾祸. </li>
          <li>求名: 初出茅庐, 应继续充实自己. 待机行动. 尤应远小人近君子和有才德的人, 以期迅速提高自己. </li>
          <li>外出: 一旦准备充分, 立即行动, 捷足先登必有所获. </li>
          <li>婚恋: 应适时进行. 夫妻和衷共济, 可家庭和睦, 免除灾难. </li>
          <li>决策: 稳妥为宜, 亦不应冒险, 因一切尚在元气初复阶段. 为争取大发展, 务必宽以待人, 以柔致治, 广交贤者, 遣散小人, 以中庸、正直的方式, 张驰结合的手段, 开拓方兴未艾的事业. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 49)  }">
      <h2>山泽损 艮上兑下</h2>
      <div class='guaci'>
        损: 有孚, 元吉, 无咎, 可贞, 利有攸往？  曷之用, 二簋可用享. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 已事遄往, 无咎, 酌损之. 
          </li>
          <li>九二: 利贞, 征凶, 弗损益之. 
          </li>
          <li>六三: 三人行, 则损一人；一人行, 则得其友. 
          </li>
          <li>六四: 损其疾, 使遄有喜, 无咎. 
          </li>
          <li>六五: 或益之, 十朋之龟弗克违, 元吉. 
          </li>
          <li>上九: 弗损益之, 无咎, 贞吉, 利有攸往, 得臣无家. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 损, 损下益上, 其道上行. 损而有孚, 元吉, 无咎, 可贞, 利有攸往. 
        曷之用？ 二簋可用享；二簋应有时. 损刚益柔有时, 损益盈虚, 与时偕行. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 山下有泽, 损；君子以惩忿窒欲. 
        已事遄往, 尚合志也. 
        九二利贞, 中以为志也. 
        一人行, 三则疑也. 
        损其疾, 亦可喜也. 
        六五元吉, 自上佑也. 
        弗损益之, 大得志也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 时动不至费心多, 比作推车受折磨, 山路崎岖吊下耳, 做插右按按不着. </li>
          <li>这个卦是异卦（下兑上艮）相叠. 艮为山；兑为泽. 上山下泽, 大泽浸蚀山根. 损益相间, 损中有益, 益中有损. 二者之间, 不可不慎重对待. 损下益上, 治理国家, 过度会损伤国基. 应损则损, 但必量力、适度. 少损而益最佳. </li>
          <li>事业: 开拓事业必有投入. 投入多少应事先精心算计, 力求损益得当. 诸事皆应有节度, 切忌欺诈、贪婪. 天下事克已最难, 务严格要求自己, 刻苦奋斗, 手段灵活, 争取事业成功. </li>
          <li>经商: 全面调查市场行情, 计算投入和收益的比例. 不必过于计较利润的多少, 获利即可. 真诚与他人合作, 彼此信任, 手段灵活, 切勿自我封闭. </li>
          <li>求名: 为了成长进步, 务必有所投入, 且应付诸实践. 以损增益, 成就理想. </li>
          <li>外出: 有益可行. 注意节省费用, 防止损多于益. </li>
          <li>婚恋: 全面权衡对方的长处与短处. 大处着眼. </li>
          <li>决策: 为人聪颖, 善于权衡利弊. 顺应自然发展规律, 积极主动与他人合作, 助人为乐, 适度投入, 资助他人, 而自己要宁俭勿奢. 如此, 诸事都可以十分顺利. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 35)  }">
      <h2>风雷益 巽上震下 </h2>
      <div class='guaci'>
        益: 利有攸往, 利涉大川. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 利用为大作, 元吉, 无咎. 
          </li>
          <li>六二: 或益之, 十朋之龟弗克违, 永贞吉.  王用享于帝, 吉. 
          </li>
          <li>六三: 益之用凶事, 无咎.  有孚中行, 告公用圭. 
          </li>
          <li>六四: 中行, 告公从.  利用为依迁国. 
          </li>
          <li>九五: 有孚惠心, 勿问元吉.  有孚惠我德. 
          </li>
          <li>上九: 莫益之, 或击之, 立心勿恒, 凶. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 益, 损上益下, 民说无疆, 自上下下, 其道大光. 利有攸往, 中正
        有庆.  利涉大川, 木道乃行.  益动而巽, 日进无疆.  天施地生, 
        其益无方.  凡益之道, 与时偕行. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 风雷, 益；君子以见善则迁, 有过则改. 
        元吉无咎, 下不厚事也. 
        或益之, 自外来也. 
        益用凶事, 固有之也. 
        告公从, 以益志也. 
        有孚惠心, 勿问之矣.  惠我德, 大得志也. 
        莫益之, 偏辞也.  或击之, 自外来也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 时来运转吉气发, 多年枯木又开花, 枝叶重生多茂盛, 几人见了几人夸. </li>
          <li>这个卦是异卦（下震上巽）相叠. 巽为风；震为雷. 风雷激荡, 其势愈强, 雷愈响, 风雷相助互长, 交相助益. 此卦与损卦相反. 它是损上以益下, 后者是损下以益上. 二卦阐述的是损益的原则. </li>
          <li>事业: 大胆投入, 勇于支持他人事业, 必相得益彰. 勇敢前进, 敢作敢为. 只要心地善良、纯洁、谦虚, 事业必定与日俱增, 前程无可限量. 助人宜即时, 要在应急, 开拓事业, 内部团结一致, 人心所向, 树立恒心, 不怕冒险犯难. </li>
          <li>经商: 勿追求小利, 让利于顾客, 反而必获丰厚利润. 切忌贪心不足. 在遇到危险时应向他人求教, 争取诚实的援助. </li>
          <li>求名: 真心实意地施惠于他人, 自己必然可以得到诚心诚意的回报, 并且获得支持, 事业必成. </li>
          <li>外出: 有利可获. 大胆外出行动. </li>
          <li>决策: 心胸开阔, 乐于助人. 人际关系好, 得到众人的支持. 自己贵在树立恒心, 克服三心二意. 尤其要向比自己优秀的人学习, 借助对方的力量, 充实和发展自己. 树立必要的冒险精神. 平日要施善于人. 因此, 即使遇到危险也会得到他人救助. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 62)  }">
      <h2>泽天夬(guài) 兑上乾下</h2>
      <div class='guaci'>
        夬: 扬于王庭, 孚号, 有厉, 告自邑, 不利即戎, 利有攸往. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 壮于前趾, 往不胜为咎. 
          </li>
          <li>九二: 惕号, 莫夜有戎, 勿恤. 
          </li>
          <li>九三: 壮于頄, 有凶.  君子夬夬, 独行遇雨, 若濡有愠, 无咎. 
          </li>
          <li>九四: 臀无肤, 其行次且.  牵羊悔亡, 闻言不信. 
          </li>
          <li>九五: 苋陆夬夬, 中行无咎. 
          </li>
          <li>上六: 无号, 终有凶. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 夬, 决也, 刚决柔也. 健而说, 决而和, 扬于王庭, 柔乘五刚也. 
        孚号有厉, 其危乃光也.  告自邑, 不利即戎, 所尚乃穷也.  利有
        攸往, 刚长乃终也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 泽上于天, 夬；君子以施禄及下, 居德则忌. 
        不胜而往, 咎也. 
        有戎勿恤, 得中道也. 
        君子夬夬, 终无咎也. 
        其行次且, 位不当也.  闻言不信, 聪不明也. 
        中行无咎, 中未光也. 
        无号之凶, 终不可长也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 蜘蛛脱网赛天军, 粘住游蜂翅翎毛, 幸有大风吹破网, 脱离灾难又逍遥. </li>
          <li>这个卦是异卦（下乾上兑）相叠. 乾为天为健；兑为泽为悦. 泽气上升, 决注成雨, 雨施大地, 滋润万物. 五阳去一阴, 去之不难, 决（去之意）即可, 故名为夬（guài）, 夬即决. </li>
          <li>事业: 处在兴盛阶段, 但已孕育着普遍的危险. 务必施恩泽给他人, 勿居功自傲, 主动团结他人, 不干冒险的事. 时时提高警惕, 防止小人的破坏. 但不可莽撞, 应持和缓的手段去决断小人, 避免过犹不及. </li>
          <li>经商: 市场正在走向衰落的状态, 不宜大量活动, 随时注意转向. 开拓新领域时, 加强同他人的合作. 但务必充分注意别有用心的奸诈小人趁机捣乱和破坏. </li>
          <li>求名: 虚心求教, 充实自身实力. 但应量力而行, 不可盲目自大. 更不可同小人合流, 徒虚名而败坏事业. </li>
          <li>外出: 不宜过于频繁, 以逸待劳最佳. 外出旅行吉利. </li>
          <li>婚恋: 防止上介绍人的当, 也应注意对方的目的. </li>
          <li>决策: 性格矛盾, 往往表面刚强而内心虚弱, 在关键的时刻, 败坏事业. 虚心听取他人劝告, 切勿鲁莽, 多谋深思, 用柔和的态度待人处世. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 31)  }">
      <h2>天风姤(gòu) 乾上巽下</h2>
      <div class='guaci'>
        姤: 女壮, 勿用取女. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 系于金柅, 贞吉, 有攸往, 见凶, 羸豕孚蹢躅. 
          </li>
          <li>九二: 包有鱼, 无咎, 不利宾. 
          </li>
          <li>九三: 臀无肤, 其行次且, 厉, 无大咎. 
          </li>
          <li>九四: 包无鱼, 起凶. 
          </li>
          <li>九五: 以杞包瓜, 含章, 有陨自天. 
          </li>
          <li>上九: 姤其角, 吝, 无咎. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 姤, 遇也, 柔遇刚也. 勿用取女, 不可与长也.  天地相遇, 品物
        咸章也.  刚遇中正, 天下大行也.  姤之时义大矣哉！
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 天下有风, 姤；后以施命诰四方. 
        系于金柅, 柔道牵也. 
        包有鱼, 义不及宾也. 
        其行次且, 行未牵也. 
        无鱼之凶, 远民也. 
        九五含章, 中正也.  有陨自天, 志不舍命也. 
        姤其角, 上穷吝也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 他乡遇友喜气欢, 须知运气福重添, 自今交了顺当运, 向后管保不相干. </li>
          <li>这个卦是异卦（下巽上乾）相叠. 乾为天, 巽为风. 天下有风, 吹遍大地, 阴阳交合, 万物茂盛. 姤（gǒu）卦与夬卦相反, 互为"综卦". 姤即遘, 阴阳相遇. 但五阳一阴, 不能长久相处. </li>
          <li>事业: 合时宜, 循时序. 但潜在着危机, 阴阳不协调. 务必依附于强者, 多方联系, 增强势力, 防止小人渔利, 争取形势好转. 诸事宜及早准备, 等待时机, 一旦成熟立刻行动. </li>
          <li>经商: 市场正从红火的状态走向衰危, 及早脱身为妙, 强行发展有危险. 无正直的人相助, 却有小人在暗中盘算. 对此, 务必保持清醒的头脑, 寻求可靠的合作伙伴, 隐忍待时, 以图商业活动的再发展. </li>
          <li>求名: 性格不很合群, 内心自视过高, 不免处于困境而不得志. 应投靠真诚正直的人, 在其支持下成功. </li>
          <li>外出: 有困难, 虽无大灾祸, 但无人相助. </li>
          <li>婚恋: 严格考察对方的道德品质, 避免陷入"三角"纠纷. 夫妻以诚相待, 可转危为安. </li>
          <li>决策: 吉利. 可在有利的环境中顺利发展, 但决不可冒险行事, 以免适得其反. 其次在于随时提防身边小人的陷害. 为此, 在邪恶未成势之前即应制止, 宁可孤立也不可与小人结伴. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 6)  }">
      <h2>泽地萃(cuì) 兑上坤下</h2>
      <div class='guaci'>
        萃: 亨.  王假有庙, 利见大人, 亨, 利贞.  用大牲吉, 利有攸往. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 有孚不终, 乃乱乃萃, 若号一握为笑, 勿恤, 往无咎. 
          </li>
          <li>六二: 引吉, 无咎, 孚乃利用禴. 
          </li>
          <li>六三: 萃如, 嗟如, 无攸利, 往无咎, 小吝. 
          </li>
          <li>九四: 大吉, 无咎. 
          </li>
          <li>九五: 萃有位, 无咎.  匪孚, 元永贞, 悔亡. 
          </li>
          <li>上六: 赍咨涕洟, 无咎. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 萃, 聚也；顺以说, 刚中而应, 故聚也. 王假有庙, 致孝享也. 利
        见大人亨, 聚以正也.  用大牲吉, 利有攸往, 顺天命也.  观其所
        聚, 而天地万物之情可见矣. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 泽上於地, 萃；君子以除戎器, 戒不虞. 
        乃乱乃萃, 其志乱也. 
        引吉无咎, 中未变也. 
        往无咎, 上巽也. 
        大吉无咎, 位不当也. 
        萃有位, 志未光也. 
        赍咨涕洟, 未安上也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 游鱼戏水被网惊, 跳过龙门身化龙, 三尺杨柳垂金钱, 万朵桃花显你能. </li>
          <li>这个卦是异卦相叠（下坤上兑）. 坤为地、为顺；兑为泽、为水. 泽泛滥淹没大地, 人众多相互斗争, 危机必四伏, 务必顺天任贤, 未雨绸缪, 柔顺而又和悦, 彼此相得益彰, 安居乐业. 萃, 聚集、团结. </li>
          <li>事业: 兴旺发达, 团结和睦. 正在蒸蒸日上, 但水多泛滥, 人多竞争必然激烈. 盛则必衰, 切勿骄傲, 谨慎小心为好. 但也不得犹豫不决, 宜勇往直前, 开拓新的业务. 务以高尚的品德服众. </li>
          <li>经商: 真诚合作, 团结互助. 鼓励是事业兴旺发达的标志. 大胆开拓市场, 稳妥前进, 有备无患, 必可取得不断发展. </li>
          <li>求名: 光靠个人努力, 建树不会很大, 定要取得他人的帮助, 加上个人的条件方可达到理想的境界. </li>
          <li>外出: 出行虽可能遇到小麻烦, 但不要害怕, 应以大局为重, 积极行动. </li>
          <li>婚恋: 勿急于求成, 相亲相爱, 美满幸福. </li>
          <li>决策: 善于团结他人共同合作, 具有领导才能. 但心胸宽阔, 眼光务必远大, 以诚信、中正为本, 不失原则, 尤其要严格要求自己, 宽容他人, 遭到他人反对时, 应认真反省自己, 得出教训, 以这种心境处世为人, 终生可平安, 事业必通达. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 24)  }">
      <h2>地风升 坤上巽下</h2>
      <div class='guaci'>
        升: 元亨, 用见大人, 勿恤, 南征吉. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 允升, 大吉. 
          </li>
          <li>九二: 孚乃利用禴, 无咎. 
          </li>
          <li>九三: 升虚邑. 
          </li>
          <li>六四: 王用亨于岐山, 吉无咎. 
          </li>
          <li>六五: 贞吉, 升阶. 
          </li>
          <li>上六: 冥升, 利于不息之贞. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 柔以时升, 巽而顺, 刚中而应, 是以大亨. 用见大人, 勿恤；有庆
        也.  南征吉, 志行也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 地中生木, 升；君子以顺德, 积小以高大. 
        允升大吉, 上合志也. 
        九二之孚, 有喜也. 
        升虚邑, 无所疑也. 
        王用亨于岐山, 顺事也. 
        贞吉升阶, 大得志也. 
        冥升在上, 消不富也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 游鱼戏水被网惊, 跳过龙门身化龙, 三尺杨柳垂金钱, 万朵桃花显你能. </li>
          <li>这个卦是异卦相叠（下坤上兑）. 坤为地、为顺；兑为泽、为水. 泽泛滥淹没大地, 人众多相互斗争, 危机必四伏, 务必顺天任贤, 未雨绸缪, 柔顺而又和悦, 彼此相得益彰, 安居乐业. 萃, 聚集、团结. </li>
          <li>事业: 兴旺发达, 团结和睦. 正在蒸蒸日上, 但水多泛滥, 人多竞争必然激烈. 盛则必衰, 切勿骄傲, 谨慎小心为好. 但也不得犹豫不决, 宜勇往直前, 开拓新的业务. 务以高尚的品德服众. </li>
          <li>经商: 真诚合作, 团结互助. 鼓励是事业兴旺发达的标志. 大胆开拓市场, 稳妥前进, 有备无患, 必可取得不断发展. </li>
          <li>求名: 光靠个人努力, 建树不会很大, 定要取得他人的帮助, 加上个人的条件方可达到理想的境界. </li>
          <li>外出: 出行虽可能遇到小麻烦, 但不要害怕, 应以大局为重, 积极行动. </li>
          <li>婚恋: 勿急于求成, 相亲相爱, 美满幸福. </li>
          <li>决策: 善于团结他人共同合作, 具有领导才能. 但心胸宽阔, 眼光务必远大, 以诚信、中正为本, 不失原则, 尤其要严格要求自己, 宽容他人, 遭到他人反对时, 应认真反省自己, 得出教训, 以这种心境处世为人, 终生可平安, 事业必通达. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 22)  }">
      <h2>泽水困 兑上坎下</h2>
      <div class='guaci'>
        困: 亨, 贞, 大人吉, 无咎, 有言不信. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 臀困于株木, 入于幽谷, 三岁不觌. 
          </li>
          <li>九二: 困于酒食, 朱绂方来, 利用亨祀, 征凶, 无咎. 
          </li>
          <li>六三: 困于石, 据于蒺藜, 入于其宫, 不见其妻, 凶. 
          </li>
          <li>九四: 来徐徐, 困于金车, 吝, 有终. 
          </li>
          <li>九五: 劓刖, 困于赤绂, 乃徐有说, 利用祭祀. 
          </li>
          <li>上六: 困于葛藟, 于臲卼, 曰动悔.  有悔, 征吉. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 困, 刚掩也.  险以说, 困而不失其所, 亨；其唯君子乎？ 贞大人
        吉, 以刚中也.  有言不信, 尚口乃穷也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 泽无水, 困；君子以致命遂志. 
        入于幽谷, 幽不明也. 
        困于酒食, 中有庆也. 
        据于蒺藜, 乘刚也.  入于其宫, 不见其妻, 不祥也. 
        来徐徐, 志在下也.  虽不当位, 有与也. 
        劓刖, 志未得也. 乃徐有说, 以中直也. 利用祭祀, 受福也. 
        困于葛藟, 未当也.  动悔, 有悔吉, 行也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 时运不来好伤怀, 撮上押去把梯抬, 一筒虫翼无到手, 转了上去下不来. </li>
          <li>这个卦是异卦（下坎上兑）相叠. 兑为阴为泽喻悦；坎为阳为水喻险. 泽水困, 陷入困境, 才智难以施展, 仍坚守正道, 自得其乐, 必可成事, 摆脱困境. </li>
          <li>事业: 境况十分不佳, 遭受到很大的困难. 人生面临巨大的考验, 如采取不正当的手段, 会愈陷愈深. 相反, 如身陷困逆境地而不失节操, 自勉自坚, 泰然处之. 不失其志. 终能成事. </li>
          <li>经商: 面临激烈竞争, 很有破产的可能. 切勿失望, 而应在困境中奋斗. 为此, 只能靠平日加强修养. 认真反省自己的行为, 总结教训, 重新奋起, 但也不宜浮躁, 应缓慢而进. 同时, 更要警惕因致富发财, 得意忘形而陷入新的困境. </li>
          <li>求名: 欲速则不达. 应以谦虚的态度, 缓慢前进, 尤应有坚定的志向, 唯有志才能促成事业的成功. </li>
          <li>外出: 困难多, 慎重考虑. </li>
          <li>婚恋: 以乐观态度冷静处理, 尤应注重人品. </li>
          <li>决策: 聪明智慧, 但怀才不遇. 若不因困境而失去信心, 坚持努力上进, 放弃侥幸心理, 锲而不舍, 虽不一定能守全实现自己的理想, 但终会有所成. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 26)  }">
      <h2>水风井 坎上巽下</h2>
      <div class='guaci'>
        井: 改邑不改井, 无丧无得, 往来井井. 汔至, 亦未繘井, 羸其瓶, 凶. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 井泥不食, 旧井无禽. 
          </li>
          <li>九二: 井谷射鲋, 瓮敝漏. 
          </li>
          <li>九三: 井渫不食, 为我心恻, 可用汲, 王明, 并受其福. 
          </li>
          <li>六四: 井甃, 无咎. 
          </li>
          <li>九五: 井冽, 寒泉食. 
          </li>
          <li>上六: 井收勿幕, 有孚元吉. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 巽乎水而上水, 井；井养而不穷也. 改邑不改井, 乃以刚中也. 汔
        至亦未繘井, 未有功也.  羸其瓶, 是以凶也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 木上有水, 井；君子以劳民劝相. 
        井泥不食, 下也.  旧井无禽, 时舍也. 
        井谷射鲋, 无与也. 
        井渫不食, 行恻也.  求王明, 受福也. 
        井甃无咎, 修井也. 
        寒泉之食, 中正也. 
        元吉在上, 大成也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 枯井破费已多年, 一朝流泉出来鲜, 资生济渴人称羡, 时来运转喜自然. </li>
          <li>这个卦是异卦（下巽上坎）相叠. 坎为水；巽为木. 树木得水而蓬勃生长. 人靠水井生活, 水井由人挖掘而成. 相互为养, 井以水养人, 经久不竭, 人应取此德而勤劳自勉. </li>
          <li>事业: 处于平稳状态. 既不宜贸然前进, 也不必后退, 而应以积极的态度努力进修, 提高自己, 充实个人实力, 待机而起, 将大有成就. 最怕的是停顿不前, 否则将会因不合时宜而被淘汰. </li>
          <li>经商: 市场情况良好, 可继续按照原来的方针. 同时, 继续本着勤劳、奋进的精神, 诚心诚意地开拓市场, 特别注意与人的合作, 相互协助, 在实践活动中丰富和积累经验. </li>
          <li>求名: 本着正当的目的, 为社会做贡献, 因此而努力学习. 应特别注意向贤德的人求教, 以便被发现而受到推荐. </li>
          <li>外出: 没有十分的必要和充分的把握不可随意出行. </li>
          <li>婚恋: 不必过急, 会有般配的伴侣. </li>
          <li>决策: 聪明、机敏、乐于助人. 同时, 也会有机会充分施展个人的才能. 只要能学习"水井"的精神, 真诚奉献, 不断丰富自己的才能, 一定会受到社会的重视. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 46)  }">
      <h2>泽火革 兑上离下</h2>
      <div class='guaci'>
        革: 巳日乃孚, 元亨利贞, 悔亡. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 巩用黄牛之革. 
          </li>
          <li>六二: 巳日乃革之, 征吉, 无咎. 
          </li>
          <li>九三: 征凶, 贞厉, 革言三就, 有孚. 
          </li>
          <li>九四: 悔亡, 有孚改命, 吉. 
          </li>
          <li>九五: 大人虎变, 未占有孚. 
          </li>
          <li>上六: 君子豹变, 小人革面, 征凶, 居贞吉. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 革, 水火相息, 二女同居, 其志不相得, 曰革. 巳日乃孚；革而信
        之.  文明以说, 大亨以正, 革而当, 其悔乃亡. 天地革而四时成, 
        汤武革命, 顺乎天而应乎人, 革之时大矣哉！
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 泽中有火, 革；君子以治历明时. 
        巩用黄牛, 不可以有为也. 
        巳日革之, 行有嘉也. 
        革言三就, 又何之矣. 
        改命之吉, 信志也. 
        大人虎变, 其文炳也. 
        君子豹变, 其文蔚也.  小人革面, 顺以从君也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 苗逢旱天渐渐衰, 幸得天恩降雨来, 忧去喜来能变化, 求谋干事遂心怀. </li>
          <li>这个卦是异卦（下离上兑）相叠. 离为火、兑为泽, 泽内有水. 水在上而下浇, 火在下而上升. 火旺水干；水大火熄. 二者相生亦相克, 必然出现变革. 变革是宇宙的基本规律. </li>
          <li>事业: 正处在转折的关键时刻, 必须密切注意各种信息, 认真思考. 首先巩固自己的地位, 完善个人的行为. 时机成熟后, 立即行动, 积极进行变革. 但应注意动机纯正, 手段正当, 不保守也不妄进, 事业必定发达. </li>
          <li>经商: 市场竞争十分激烈. 为了立于不败之地, 一定要敢于大胆求新, 适时改变自己的经营方向, 受到挫败, 马上总结经验, 重新奋起, 拓展商业活动. 注意竞争方式. </li>
          <li>求名: 首先要努力提高自己, 完善个人的学识和品德. 同时, 服从上级指挥搞好工作. 二者的关系一定要得到妥善处理. </li>
          <li>外出: 十分顺利, 积极活动, 扩大人际关系. </li>
          <li>婚恋: 可能会出现一些节外生枝的麻烦事, 应冷静处理, 感情专注. </li>
          <li>决策: 十分吉利、顺利. 以自己的聪明才智, 顺应形势, 根据时代特点, 依理而动, 变革渐合时宜的事物, 壮大自己的事业. 但应谨慎, 时机不成熟不可妄动, 尤忌急功近利. 行动之前应三思而行. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 29)  }">
      <h2>火风鼎 离上巽下</h2>
      <div class='guaci'>
        鼎: 元吉, 亨. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 鼎颠趾, 利出否, 得妾以其子, 无咎. 
          </li>
          <li>九二: 鼎有实, 我仇有疾, 不我能即, 吉. 
          </li>
          <li>九三: 鼎耳革, 其行塞, 雉膏不食, 方雨亏悔, 终吉. 
          </li>
          <li>九四: 鼎折足, 覆公餗, 其形渥, 凶. 
          </li>
          <li>六五: 鼎黄耳金铉, 利贞. 
          </li>
          <li>上九: 鼎玉铉, 大吉, 无不利. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 鼎, 象也.  以木巽火, 亨饪也.  圣人亨以享上帝, 而大亨以养圣
        贤.  巽而耳目聪明, 柔进而上行, 得中而应乎刚, 是以元亨. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 木上有火, 鼎；君子以正位凝命. 
        鼎颠趾, 未悖也.  利出否, 以从贵也. 
        鼎有实, 慎所之也.  我仇有疾, 终无尤也. 
        鼎耳革, 失其义也. 
        覆公餗, 信如何也. 
        鼎黄耳, 中以为实也. 
        玉铉在上, 刚柔节也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 莺鹜蛤蜊落沙滩, 蛤蜊莺鹜两翅扇, 渔人进前双得利, 失走行人却自在. </li>
          <li>这个卦是异卦（下巽上离）相叠. 燃木煮食, 化生为熟, 除旧布新的意思. 鼎为重宝大器, 三足稳重之象. 煮食, 喻食物充足, 不再有困难和困扰. 在此基础上宜变革, 发展事业. </li>
          <li>事业: 具备开拓事业的各种条件. 耳聪目明, 头脑冷静, 应以端正的态度去为人处世, 严于律已, 慎终如始, 刚柔兼备, 与有才德的人合作, 勿妄进失度, 无往不利. </li>
          <li>经商: 经过一番奋斗, 已经可以比较顺利地发展自己的商业活动, 遇到困难也能够克服. 如果坚持商业道德, 参与正常竞争活动, 无轻举妄动和邪思, 刚中自守, 商业可大发展, 但若不量入为出, 坐吃山空, 必败业. </li>
          <li>求名: 首先应实德积识, 严于律已, 不陷入与他人的怨仇之中, 柔而上行, 循序渐进. 得到知人者的善用, 更是前途广大. </li>
          <li>外出: 无重大事情不宜外出. 为发展事业外出顺利. </li>
          <li>婚恋: 个人条件比较理想, 顺利, 但勿不切合自己的实际. </li>
          <li>决策: 天资聪颖, 反应敏捷, 头脑灵活, 具备随机应变, 随时应变和随势应变的能力. 因此, 前程远大, 即使暂时不受重视, 无出路也无防, 最终可实现抱负. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 36)  }">
      <h2>震为雷 震上震下</h2>
      <div class='guaci'>
        震: 亨.  震来虩虩, 笑言哑哑.  震惊百里, 不丧匕鬯. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 震来虩虩, 后笑言哑哑, 吉. 
          </li>
          <li>六二: 震来厉, 亿丧贝, 跻于九陵, 勿逐, 七日得. 
          </li>
          <li>六三: 震苏苏, 震行无眚. 
          </li>
          <li>九四: 震遂泥. 
          </li>
          <li>六五: 震往来厉, 亿无丧, 有事. 
          </li>
          <li>上六: 震索索, 视矍矍, 征凶.  震不于其躬, 于其邻, 无咎.  婚媾有言. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 震, 亨.  震来虩虩, 恐致福也. 笑言哑哑, 后有则也.  震惊百
        里, 惊远而惧迩也.  出可以守宗庙社稷, 以为祭主也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 洊雷, 震；君子以恐惧修省. 
        震来虩虩, 恐致福也.  笑言哑哑, 后有则也. 
        震来厉, 乘刚也. 
        震苏苏, 位不当也. 
        震遂泥, 未光也. 
        震往来厉, 危行也.  其事在中, 大无丧也. 
        震索索, 未得中也.  虽凶无咎, 畏邻戒也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 一口金钟在淤泥, 人人拿着当玩石, 忽然一日钟悬起, 响亮一声天下知. </li>
          <li>这个卦是同卦（下震上震）相叠. 震为雷, 两震相叠, 反响巨大, 可消除沉闷之气, 亨通畅达. 平日应居安思危, 怀恐惧心理, 不敢有所怠慢, 遇到突发事变, 也能安然自若, 谈笑如常. </li>
          <li>事业: 处于不顺利、甚至面临危险的局面, 对此务必提高警惕, 有备方可无患, 一旦出现突发事件, 可以泰然处之, 并且可以由此引吸取教训, 一方面使损失减少, 另一方面可以迅速复原, 使事业迈上新的高度. </li>
          <li>经商: 在激烈的商场竞争中, 随时可能出现问题, 陷入困境. 冷静、从容地应付到来的现实, 坚持不偏不激的中正原则, 以刚毅的态度, 从容不迫地去战胜困难. 经过一番危机后, 一定可以获得巨大利益. </li>
          <li>求名: 很可能会遭到挫折. 不必灰心, 而应自我反省, 找出问题的症结所在. </li>
          <li>外出: 大胆出行, 不必理会小的灾祸. </li>
          <li>婚恋: 恋爱和家庭都可能出现变故, 应以冷静态度处理, 会有理想的结果. </li>
          <li>决策: 处于人生的转折关头. 应正确地总结过去, 为开拓新的事业奠定基础. 在前进的道路上应随时心怀恐惧, 勤勤恳恳, 坚持正确原则, 在困难中前进, 命运亨通. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 9)  }">
      <h2>艮为山 艮上艮下</h2>
      <div class='guaci'>
        艮: 艮其背, 不获其身, 行其庭, 不见其人, 无咎. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 艮其趾, 无咎, 利永贞. 
          </li>
          <li>六二: 艮其腓, 不拯其随, 其心不快. 
          </li>
          <li>九三: 艮其限, 列其夤, 厉薰心. 
          </li>
          <li>六四: 艮其身, 无咎. 
          </li>
          <li>六五: 艮其辅, 言有序, 悔亡. 
          </li>
          <li>上九: 敦艮, 吉. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 艮, 止也.  时止则止, 时行则行, 动静不失其时, 其道光明.  艮其止, 
        止其所也.  上下敌应, 不相与也.  是以不获其身, 行其庭不见其人, 无咎也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 兼山, 艮；君子以思不出其位. 
        艮其趾, 未失正也. 
        不拯其随, 未退听也. 
        艮其限, 危薰心也. 
        艮其身, 止诸躬也. 
        艮其辅, 以中正也. 
        敦艮之吉, 以厚终也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 财帛常打心头走, 可惜眼前难到手, 不如意时且忍耐, 逢着闲事休开口. </li>
          <li>这个卦是同卦（下艮上艮）相叠. 艮为山, 二山相重, 喻静止. 它和震卦相反. 高潮过后, 必然出现低潮, 进入事物的相对静止阶段. 静止如山, 宜止则止, 宜行则行. 行止即动和静, 都不可失机, 应恰到好处, 动静得宜, 适可而止. </li>
          <li>事业: 在经过一段发展后, 应进行调整, 暂时停止行动, 总结经验教训. 不可因贪名利而妄进. 自我克制, 自我约束, 谨言慎行, 不要盲目追求他人. 经过休整后, 在适当时机到来时, 再大显身手. </li>
          <li>经商: 进入停滞不前的状态, 切勿盲目冒进, 而宜适时停止, 进入安静退守, 不要受外界干扰, 尤其是应该保持内心和理智上的宁静, 更不要轻易与他人合作. 等待时机, 必有光明前途. </li>
          <li>求名: 应保持纯正的目的, 静守正道. 勿为功名诱惑, 秉守忠厚, 可得成功. </li>
          <li>外出: 慎重为好, 宜另择佳日. </li>
          <li>婚恋: 重感情, 彼此以诚相待, 可白头到老. </li>
          <li>决策: 性格沉静、内向, 不喜好活动, 也不善于交际, 为人忠诚老实, 讲信义. 注意听取他人的建议, 明哲保身. 机遇不到, 不宜积极活动, 该止则止, 勿抱不切实际的想法. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 11)  }">
      <h2>风山渐 巽上艮下</h2>
      <div class='guaci'>
        渐: 女归吉, 利贞. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 鸿渐于干, 小子厉, 有言, 无咎. 
          </li>
          <li>六二: 鸿渐于磐, 饮食衎衎, 吉. 
          </li>
          <li>九三: 鸿渐于陆, 夫征不复, 妇孕不育, 凶；利御寇. 
          </li>
          <li>六四: 鸿渐于木, 或得其桷, 无咎. 
          </li>
          <li>九五: 鸿渐于陵, 妇三岁不孕, 终莫之胜, 吉. 
          </li>
          <li>上九: 鸿渐于陆, 其羽可用为仪, 吉. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 渐之进也, 女归吉也.  进得位, 往有功也. 进以正, 可以正邦也. 
        其位刚, 得中也.  止而巽, 动不穷也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 山上有木, 渐；君子以居贤德, 善俗. 
        小子之厉, 义无咎也. 
        饮食衎衎, 不素饱也. 
        夫征不复, 离群丑也.  妇孕不育, 失其道也. 利用御寇, 顺相保也. 
        或得其桷, 顺以巽也. 
        终莫之胜, 吉；得所愿也. 
        其羽可用为仪, 吉；不可乱也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 俊鸟幸得出笼中, 脱离灾难显威风, 一朝得意福力至, 东西南北任意行. </li>
          <li>这个卦是异卦（下艮上巽）相叠. 艮为山, 巽为木. 山上有木, 逐渐成长, 山也随着增高. 这是逐渐进步的过程, 所以称渐, 渐即进, 渐渐前进而不急速. </li>
          <li>事业: 在经过一个相对静止的时期后, 重新开始了事业的新阶段. 这时最怕的是急躁冒进, 务必循序上进, 脚踏实地. 同是注意品德修养, 以沉着、谦逊的态度对待事业, 可无往而不利. </li>
          <li>经商: 正处在稳步向前发展的阶段, 定要把握时机, 既不可盲目乐观, 也不要停步不前, 而应采取逐步前进的策略, 量力而行. 遵守商业道德, 以良好的服务, 开拓市场. </li>
          <li>求名: 效法树木植根山上, 逐渐生长的精神. 在品德和学业两个方面, 扎扎实实地提高自己. 同时, 肩负起改善社会风俗的责任. 求名应以渐进为宜, 切不可争进. </li>
          <li>外出: 准备充分, 从容外出, 一路平安. </li>
          <li>婚恋: 不可操之过急. 幸福、美满, 夫妻白头和谐. </li>
          <li>决策: 时来运转的时刻已经到来, 切莫错过良机. 务必小心谨慎, 渐进有益有利. 以谦和的态度处世, 可以得到强有力的支持, 会获得重大成功. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 52)  }">
      <h2>雷泽归妹 震上兑下</h2>
      <div class='guaci'>
        归妹: 征凶, 无攸利. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 归妹以娣, 跛能履, 征吉. 
          </li>
          <li>九二: 眇能视, 利幽人之贞. 
          </li>
          <li>六三: 归妹以须, 反归以娣. 
          </li>
          <li>九四: 归妹愆期, 迟归有时. 
          </li>
          <li>六五: 帝乙归妹, 其君之袂, 不如其娣之袂良, 月几望, 吉. 
          </li>
          <li>上六: 女承筐无实, 士刲羊无血, 无攸利. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 归妹, 天地之大义也. 天地不交, 而万物不兴, 归妹人之终始也. 
        说以动, 所归妹也.  征凶, 位不当也.  无攸利, 柔乘刚也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 泽上有雷, 归妹；君子以永终知敝. 
        归妹以娣, 以恒也.  跛能履吉, 相承也. 
        利幽人之贞, 未变常也. 
        归妹以须, 未当也. 
        愆期之志, 有待而行也. 
        帝乙归妹, 不如其娣之袂良也.  其位在中, 以贵行也. 
        上六无实, 承虚筐也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 求鱼须当向水中, 树上求之不顺情, 受尽爬揭难随意, 劳而无功运平平. </li>
          <li>这个卦是异卦（下兑上震）相叠. 震为动、为长男；兑为悦、为少女. 以少女从长男, 产生爱慕之情, 有婚姻之动, 有嫁女之象, 故称归妹. 男婚女嫁, 天地大义, 人的开始和终结. 上卦与渐卦为综卦, 交互为用. </li>
          <li>事业: 正在进入新的阶段, 很快将会出现另一番景象. 这时首先必须具备远大眼光, 识破利弊和吉凶, 有备始能无患. 其次是坚守纯正的品德和正确的原则. </li>
          <li>经商: 开拓新的市场即将成功. 在未来的商业活动中必须注意经营的方向和种类, 加强与他人合作. </li>
          <li>求名: 务必以坚定的决心, 努力提高自己, 为成名立业奠定基础, 最可怕是儿女情长影响了自己的前途和事业. </li>
          <li>外出: 十分顺利, 即便发生意外也会有人相助. </li>
          <li>婚恋: 顺其自然, 不可违背原则, 尤其不可强求, 宁可晚婚也要选择理想的对象. 夫妻经过生活考验, 可和谐到老. </li>
          <li>决策: 对于人生必须坚持公正纯洁的品德, 正确对待婚姻和家庭, 以幸福美满的家庭为基础, 开拓和发展自己的事业. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 44)  }">
      <h2>雷火丰 震上离下</h2>
      <div class='guaci'>
        丰: 亨, 王假之, 勿忧, 宜日中. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 遇其配主, 虽旬无咎, 往有尚. 
          </li>
          <li>六二: 丰其蔀, 日中见斗, 往得疑疾, 有孚发若, 吉. 
          </li>
          <li>九三: 丰其沛, 日中见沫, 折其右肱, 无咎. 
          </li>
          <li>九四: 丰其蔀, 日中见斗, 遇其夷主, 吉. 
          </li>
          <li>六五: 来章, 有庆誉, 吉. 
          </li>
          <li>上六: 丰其屋, 蔀其家, 窥其户, 阒其无人, 三岁不觌, 凶. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 丰, 大也.  明以动, 故丰. 王假之, 尚大也.  勿忧宜日中, 宜照
        天下也. 日中则昃, 月盈则食, 天地盈虚, 与时消息, 而况人於人
        乎？况於鬼神乎？
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 雷电皆至, 丰；君子以折狱致刑. 
        虽旬无咎, 过旬灾也. 
        有孚发若, 信以发志也. 
        丰其沛, 不可大事也.  折其右肱, 终不可用也. 
        丰其蔀, 位不当也.  日中见斗, 幽不明也.  遇其夷主, 吉；行也. 
        六五之吉, 有庆也. 
        丰其屋, 天际翔也.  窥其户, 阒其无人, 自藏也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 古镜昏暗好几年, 一朝磨明似月圆, 君子谋事逢此卦, 近来运转喜自然. </li>
          <li>这个卦是异卦（下离上震）相叠, 电闪雷鸣, 成就巨大, 喻达到顶峰, 如日中天. 告戒；务必注意事物向相反方面发展. 治乱相因, 盛衰无常, 不可不警惕. </li>
          <li>事业: 处于十分顺利的鼎盛时期, 各方面都很顺利, 成就很大. 但务必注意开始出现的衰败症状, 防微杜渐, 严防骄傲自满. 同时, 不必盲目追求不切实际的事情, 全力保持当前状况的延长. </li>
          <li>经商: 由于准确地把握了市场动态, 商情对自己十分有利, 可以大胆发展, 但一定要密切注意行情, 分析信息, 稍有不慎, 破产可能在一夜间. 一旦破产应立即总结教训寻求真诚的合作者, 早日走出困境. </li>
          <li>求名: 经过努力和奋斗, 已获得成就, 应注意保持和稳步发展, 切勿追求虚名. </li>
          <li>外出: 十分顺利. 但应提高警惕, 防止乐极生悲. </li>
          <li>婚恋: 可以成功, 也会美满幸福, 但若一方自持条件变化而动摇, 则会导致不利. </li>
          <li>决策: 由于个人天资聪颖, 条件好, 因此各方面十分顺利. 但务必深刻认识人生无常的真理, 一切应保持适度, 切记物极必反. 更不应自我封闭, 陷入困境, 切莫灰心. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 13)  }">
      <h2>火山旅 离上艮下</h2>
      <div class='guaci'>
        旅: 小亨, 旅贞吉. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 旅琐琐, 斯其所取灾. 
          </li>
          <li>六二: 旅即次, 怀其资, 得童仆贞. 
          </li>
          <li>九三: 旅焚其次, 丧其童仆, 贞厉. 
          </li>
          <li>九四: 旅于处, 得其资斧, 我心不快. 
          </li>
          <li>六五: 射雉一矢亡, 终以誉命. 
          </li>
          <li>上九: 鸟焚其巢, 旅人先笑后号啕.  丧牛于易, 凶. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 旅, 小亨, 柔得中乎外, 而顺乎刚, 止而丽乎明, 是以小亨, 旅贞
        吉也.  旅之时义大矣哉！
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 山上有火, 旅；君子以明慎用刑, 而不留狱. 
        旅琐琐, 志穷灾也. 
        得童仆贞, 终无尤也. 
        旅焚其次, 亦以伤矣.  以旅与下, 其义丧也. 
        旅于处, 未得位也.  得其资斧, 心未快也. 
        终以誉命, 上逮也. 
        以旅在上, 其义焚也.  丧牛于易, 终莫之闻也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 飞鸟树上垒窝巢, 小人使计举火烧, 君占此卦为不吉, 一切谋望枉徒劳. </li>
          <li>这个卦是异卦（下艮上离）相叠. 此卦与丰卦相反, 互为"综卦". 山中燃火, 烧而不止, 火势不停地向前蔓延, 如同途中行人, 急于赶路. 因而称旅卦. </li>
          <li>事业: 正处于创业、发展的阶段, 各种困难很多. 只要能坚持中正的方针, 依正道办事, 注意调查, 处处小心谨慎, 并根据情况的变化, 采取应变措施, 事业可顺利前进. </li>
          <li>经商: 市场行情犹如旅途一样, 意想不到的情况, 会随时发生. 因此, 首先应采取慎重的原则, 不要冒险. 但也不应缩手缩脚, 尤其不要猜疑. 开发市场之前, 应进行充分的调查研究. </li>
          <li>求名: 根据时代的要求, 丰富自己的知识和能力, 不断提高自己, 并且争取得到他人的相助. </li>
          <li>外出: 很顺利, 且经常出行. 因此, 要时时注意安全. </li>
          <li>婚恋: 双方的不确定因素较多, 如确有感情, 可顺其发展, 再行确定. 婚姻美满. </li>
          <li>决策: 人生处于多变状态, 一定要眼光远大, 树立大志向, 不断地充实自己, 以诚心实意和谦虚的态度去待人处事, 勿计较一时得失, 广泛交际朋友. 人生旅途十分顺利. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 27)  }">
      <h2>巽(xùn)为风 巽上巽下</h2>
      <div class='guaci'>
        巽: 小亨, 利攸往, 利见大人. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 进退, 利武人之贞. 
          </li>
          <li>九二: 巽在床下, 用史巫纷若, 吉无咎. 
          </li>
          <li>九三: 频巽, 吝. 
          </li>
          <li>六四: 悔亡, 田获三品. 
          </li>
          <li>九五: 贞吉悔亡, 无不利.  无初有终, 先庚三日, 后庚三日, 吉. 
          </li>
          <li>上九: 巽在床下, 丧其资斧, 贞凶. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 重巽以申命, 刚巽乎中正而志行. 柔皆顺乎刚, 是以小亨, 利有攸
        往, 利见大人. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 随风, 巽；君子以申命行事. 
        进退, 志疑也.  利武人之贞, 志治也. 
        纷若之吉, 得中也. 
        频巽之吝, 志穷也. 
        田获三品, 有功也. 
        九五之吉, 位正中也. 
        巽在床下, 上穷也.  丧其资斧, 正乎凶也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 一叶孤舟落沙滩, 有篙无水进退难, 时逢大雨江湖溢, 不用费力任往返. </li>
          <li>这个卦是同卦（下巽上巽）相叠, 巽（xùn）为风, 两风相重, 长风不绝, 无孔不入, 巽义为顺. 谦逊的态度和行为可无往不利. </li>
          <li>事业: 正在发展中, 应本着勇往直前的精神, 战胜一切困难和险阻, 奋发向上. 万事起头难, 开始会受挫折, 但在有才德和有力量的人物帮助下, 会有理想的结果. </li>
          <li>经商: 市场竞争激烈, 风险大. 商业活动务必小心谨慎, 遵守商业道德, 以谦逊的态度对待同行和顾客, 及至竞争对手, 必定可以取得利益. </li>
          <li>求名: 以谦逊的态度对待一切, 但又不可自卑、软弱、做作, 更不可虚伪, 这样就可以进步很快. </li>
          <li>外出: 一帆风顺, 十分顺利, 但仍得注意安全, 防止发生意外事故. </li>
          <li>婚恋: 不可抱轻率的态度, 而应慎重, 相互尊重. </li>
          <li>决策: 头脑聪明、灵活, 性格开朗, 以谦虚的态度处世, 会受到各个方面的欢迎, 也会得到上级的重视. 谦虚不可过度, 应以刚健中正为前提, 决不可表现为懦弱和虚伪. 否则, 不利于自身的成长. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 54)  }">
      <h2>兑为泽 兑上兑下</h2>
      <div class='guaci'>
        兑: 亨, 利贞. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 和兑, 吉. 
          </li>
          <li>九二: 孚兑, 吉, 悔亡. 
          </li>
          <li>六三: 来兑, 凶. 
          </li>
          <li>九四: 商兑, 未宁, 介疾有喜. 
          </li>
          <li>九五: 孚于剥, 有厉. 
          </li>
          <li>上六: 引兑. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 兑, 说也.  刚中而柔外, 说以利贞, 是以顺乎天, 而应乎人.  说
        以先民, 民忘其劳；说以犯难, 民忘其死；说之大, 民劝矣哉！
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 丽泽, 兑；君子以朋友讲习. 
        和兑之吉, 行未疑也. 
        孚兑之吉, 信志也. 
        来兑之凶, 位不当也. 
        九四之喜, 有庆也. 
        孚于剥, 位正当也. 
        上六引兑, 未光也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 这个卦象真可取, 觉着做事不费力, 休要错过这机关, 事事觉得随心意. </li>
          <li>这个卦是同卦（下泽上泽）相叠. 泽为水. 两泽相连, 两水交流, 上下相和, 团结一致, 朋友相助, 欢欣喜悦. 兑为悦也. 同秉刚健之德, 外抱柔和之姿, 坚行正道, 导民向上. </li>
          <li>事业: 由于善长人际关系, 能团结他人, 获得援助. 因此, 各项事业都十分顺利. 只要本人坚持中正之道, 动机纯正, 是非分明, 以诚心与人和悦, 前途光明. </li>
          <li>经商: 很有利. 可以取得多种渠道的支持. 但在顺利时切莫忘记谨慎小心的原则, 尤其警惕上小人的当. </li>
          <li>求名: 只要自己目的纯正, 并有真才实学, 一定可以受到多方面的热情帮助和资助, 实现追求目的. </li>
          <li>外出: 一路平安, 即使遇到困难也会有人帮助, 解脱困境. </li>
          <li>婚恋彼此满意, 成功的可能性很大. 但千万不要过于坚持己见. </li>
          <li>决策: 为人聪颖, 性格开朗, 头脑灵活, 心地善良, 热心为公众服务, 富有组织才能. 因此, 可以比较顺利地走上领导岗位. 但一定要坚持中正原则, 秉公办事, 不得诌媚讨好上级, 更不可欺压民众. 永远保持谦虚品德, 尤其不可过分自信, 否则很容易为坏人包围. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 19)  }">
      <h2>风水涣 巽上坎下</h2>
      <div class='guaci'>
        涣: 亨.  王假有庙, 利涉大川, 利贞. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 用拯马壮, 吉. 
          </li>
          <li>九二: 涣奔其机, 悔亡. 
          </li>
          <li>六三: 涣其躬, 无悔. 
          </li>
          <li>六四: 涣其群, 元吉.  涣有丘, 匪夷所思. 
          </li>
          <li>九五: 涣汗其大号, 涣王居, 无咎. 
          </li>
          <li>上九: 涣其血, 去逖出, 无咎. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 涣, 亨.  刚来而不穷, 柔得位乎外而上同.  王假有庙, 王乃在中
        也.  利涉大川, 乘木有功也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 风行水上, 涣；先王以享于帝立庙. 
        初六之吉, 顺也. 
        涣奔其机, 得愿也. 
        涣其躬, 志在外也. 
        涣其群, 元吉；光大也. 
        王居无咎, 正位也. 
        涣其血, 远害也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 隔河望见一锭金, 欲取岸宽水又深, 指望资财难到手, 尽夜资财枉费心. </li>
          <li>这个卦是异卦（下坎上巽）相叠. 风在水上行, 推波助澜, 四方流溢. 涣, 水流流散之意. 象征组织和人心涣散, 必用积极的手段和方法克服, 战胜弊端, 挽救涣散, 转危为安. </li>
          <li>事业: 处于比较困难的地步, 主要是因为人心不齐. 要采取强有力的办法, 求得安定团结. 其中, 最为重要的是坚持正道, 秉持大公无私的精神, 收人心以聚涣散. </li>
          <li>经商: 市场状况混乱, 方向不明. 适当的冒险是完全必要的. 但必须公正无私, 克制私欲. 争取有实力者的合作和支援也是完全有必要的. </li>
          <li>求名: 必须静下心来努力学习和提高知识水平, 增加才干. 涣散的形势必须进行治理, 这需要多方面的人才. 前途是光明的, 关键取决于个人的努力. </li>
          <li>外出: 平安无事, 水路更顺利. </li>
          <li>婚恋: 只要双方都抱着纯正的目的, 一定美满成功. </li>
          <li>决策: 为了开拓事业, 必须使用积极的手段, 克服和战胜内部不团结的弊病. 首先自己要除私心, 牺牲小我, 完成大我. 切莫介入是非争端之中. 这样, 可以重新获得安定的局面. 在良好的环境里, 各项事业前途光明. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 50)  }">
      <h2>水泽节 坎上兑下</h2>
      <div class='guaci'>
        节: 亨.  苦节不可贞. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 不出户庭, 无咎. 
          </li>
          <li>九二: 不出门庭, 凶. 
          </li>
          <li>六三: 不节若, 则嗟若, 无咎. 
          </li>
          <li>六四: 安节, 亨. 
          </li>
          <li>九五: 甘节, 吉；往有尚. 
          </li>
          <li>上六: 苦节, 贞凶, 悔亡. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 节, 亨, 刚柔分, 而刚得中. 苦节不可贞, 其道穷也. 说以行险, 
        当位以节, 中正以通.  天地节而四时成, 节以制度, 不伤财, 不害民. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 泽上有水, 节；君子以制数度, 议德行. 
        不出户庭, 知通塞也. 
        不出门庭, 失时极也. 
        不节之嗟, 又谁咎也. 
        安节之亨, 承上道也. 
        甘节之吉, 居位中也. 
        苦节贞凶, 其道穷也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 时来运转喜气生, 登台封神姜太公, 到此诸神皆退位, 纵然有祸不成凶. </li>
          <li>这个卦是异卦（下兑上坎）相叠. 兑为泽, 坎为水. 泽有水而流有限, 多必溢于泽外. 因此要有节度, 故称节. 节卦与涣卦相反, 互为综卦, 交相使用. 天地有节度才能常新, 国家有节度才能安稳, 个人有节度才能完美. </li>
          <li>事业: 正处在发展时期, 一定要注意切勿冒进. 但更不应放弃良好的机遇, 只要坚持遵利守义的原则, 可大胆行动. 这样, 事业可以继续兴旺发达. </li>
          <li>经商: 市场行情好, 对自己很有利, 应该努力开拓, 勿失去机会. 不过, 头脑一定要冷静, 投入应有限度, 适可而止, 该收则收. </li>
          <li>求名: 严格要求自己, 办事知道节度, 不走极端, 可以通行无阻, 顺利前进. </li>
          <li>外出: 大胆外出顺利. </li>
          <li>婚恋: 不要陷入情不自禁的地步, 顺其自然会有好结果. </li>
          <li>决策: 抓住机遇, 勿失良机. 适当节制自己的行动, 不可勉强, 更不可冒险, 恰如其分. 一切不可拘泥, 该变就变. 但是, 该节制的时候一定要节制. 节制必须有限度, 过于节制就成为苦, 不会有好的结果, 这叫适得其反, 务必十分注意. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 51)  }">
      <h2>风泽中孚(fú) 巽上兑下</h2>
      <div class='guaci'>
        中孚: 豚鱼吉, 利涉大川, 利贞. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 虞吉, 有他不燕. 
          </li>
          <li>九二: 鸣鹤在阴, 其子和之, 我有好爵, 吾与尔靡之. 
          </li>
          <li>六三: 得敌, 或鼓或罢, 或泣或歌. 
          </li>
          <li>六四: 月几望, 马匹亡, 无咎. 
          </li>
          <li>九五: 有孚挛如, 无咎. 
          </li>
          <li>上九: 翰音登于天, 贞凶. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 中孚, 柔在内而刚得中.  说而巽, 孚, 乃化邦也.  豚鱼吉, 信及
        豚鱼也.  利涉大川, 乘木舟虚也.  中孚以利贞, 乃应乎天也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 泽上有风, 中孚；君子以议狱缓死. 
        初九虞吉, 志未变也. 
        其子和之, 中心愿也. 
        或鼓或罢, 位不当也. 
        马匹亡, 绝类上也. 
        有孚挛如, 位正当也. 
        翰音登于天, 何可长也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 路上行人色匆匆, 急忙无桥过薄冰, 小心谨慎过得去, 一步错了落水中. </li>
          <li>这个卦是异卦（下兑上巽）相叠. 孚（fú）本义孵, 孵卵出壳的日期非常准确, 有信的意义. 卦形外实内虚, 喻心中诚信, 所以称中孚卦. 这是立身处世的根本. </li>
          <li>事业: 以诚实忠信的态度对待事业, 获得重大的成就, 发展顺利. 必须继续遵循正道的原则, 不可掉以轻心, 也不可过分地相信人, 尤其不可以孤傲的性格自我封闭. 否则事业将走向失败. </li>
          <li>经商: 处理得很好, 符合市场的要求. 小心谨慎地经营, 讲究信义, 优质服务, 可有满意的结果, 甚至冒险犯难也不会出问题. </li>
          <li>求名: 必须在道德修养的基础上, 刻苦学习知识和本领, 不断提高自己. 同时, 不要惧怕困难, 努力向前. </li>
          <li>外出: 非常顺利, 根据工作的需要可以经常外出. </li>
          <li>婚恋: 双方以诚信的态度相互对待, 幸福美满. </li>
          <li>决策: 以诚信为立身处世的基石, 真诚待人, 信守制度, 坚持原则, 和悦谦虚, 可以战胜任何困难, 即使出现了问题也可以亡羊补牢. 但务必增强对人的观察能力, 提高分辨是非的水平. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 12)  }">
      <h2>雷山小过 震上艮下</h2>
      <div class='guaci'>
        小过: 亨, 利贞, 可小事, 不可大事. 飞鸟遗之音, 不宜上宜下, 大吉. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 飞鸟以凶. 
          </li>
          <li>六二: 过其祖, 遇其妣；不及其君, 遇其臣；无咎. 
          </li>
          <li>九三: 弗过防之, 从或戕之, 凶. 
          </li>
          <li>九四: 无咎, 弗过遇之.  往厉必戒, 勿用永贞. 
          </li>
          <li>六五: 密云不雨, 自我西郊, 公弋取彼在穴. 
          </li>
          <li>上六: 弗遇过之, 飞鸟离之, 凶, 是谓灾眚. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 小过, 小者过而亨也.  过以利贞, 与时行也.  柔得中, 是以小事
        吉也.  刚失位而不中, 是以不可大事也.  有飞鸟之象焉, 有飞鸟
        遗之音, 不宜上宜下, 大吉；上逆而下顺也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 山上有雷, 小过；君子以行过乎恭, 丧过乎哀, 用过乎俭. 
        飞鸟以凶, 不可如何也. 
        不及其君, 臣不可过也. 
        从或戕之, 凶如何也. 
        弗过遇之, 位不当也.  往厉必戒, 终不可长也. 
        密云不雨, 已上也. 
        弗遇过之, 已亢也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 行人路过独木桥, 心内惶恐眼里瞧, 爽利保保过得去, 慢行一定不安牢. </li>
          <li>这个卦是异卦（下艮上震）相叠. 艮为山, 震为雷, 过山雷鸣, 不可不畏惧. 阳为大, 阴为小, 卦外四阴超过中二阳, 故称"小过", 小有越过. </li>
          <li>事业: 行动宜谨慎小心, 切勿冒险, 尤其不得钻营. 但只要坚持正当的行为, 可勇敢向前, 努力奋斗, 开拓事业. 不过, 一定要把握尺度, 不要好高骛远, 以免招致灾祸. 随机应变是关键. </li>
          <li>经商: 对市场行情不十分掌握, 可先稍试探一下, 随即收敛行为. 否则会导致危险. 不应大规模行动, 也不必胆小怕事. 稳扎稳打, 逐步发展. </li>
          <li>求名: 应遵循中正的原则和循序渐进的道理, 求得稳步前进. 切勿追求虚名, 更不得不顾实际情况攀高位. </li>
          <li>处出: 慎重考虑和做好充分准备后再外出, 否则不利. </li>
          <li>婚恋: 应较长时间的彼此了解, 不可仓促行事. </li>
          <li>决策: 行动必须把握分寸, 适可而止. 盛时应防止办事过火, 应即时收敛自己. 过度将不足成事, 反会招祸. 一切行动都要因应变通, 不可固执. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 42)  }">
      <h2>水火既济 坎上离下</h2>
      <div class='guaci'>
        既济: 亨, 小利贞, 初吉终乱. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初九: 曳其轮, 濡其尾, 无咎. 
          </li>
          <li>六二: 妇丧其髴, 勿逐, 七日得. 
          </li>
          <li>九三: 高宗伐鬼方, 三年克之, 小人勿用. 
          </li>
          <li>六四: 繻有衣袽, 终日戒. 
          </li>
          <li>九五: 东邻杀牛, 不如西邻之禴祭, 实受其福. 
          </li>
          <li>上六: 濡其首, 厉. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 既济, 亨, 小者亨也. 利贞, 刚柔正而位当也.  初吉, 柔得中也. 
        终止则乱, 其道穷也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 水在火上, 既济；君子以思患而豫防之. 
        曳其轮,  义无咎也. 
        七日得, 以中道也. 
        三年克之, 惫也. 
        终日戒, 有所疑也. 
        东邻杀牛, 不如西邻之时也；实受其福, 吉大来也. 
        濡其首厉, 何可久也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 金榜以上题姓名, 不负当年苦用功, 人逢此卦名吉庆, 一切谋望大亨通. </li>
          <li>这个卦是异卦（下离上坎）相叠. 坎为水, 离为火, 水火相交, 水在火上, 水势压倒火势, 救火大功告成. 既, 已经；济, 成也. 既济就是事情已经成功, 但终将发生变故. </li>
          <li>事业: 处在顺利和兴旺的阶段, 甚至大功已经告成. 如何才能保住这种势头, 是问题的关键. 必须认识盛极将衰的真理, 必思患预防, 防微杜渐, 有备可无患. 同时, 一定要密切注意形势, 抓住有利时机, 继续奋发向上, 推动事业发展. </li>
          <li>经商: 由于市场形势有利, 已经赚得许多. 但同时也预示着危机的随时出现. 因此, 务必小心在意, 事未到, 先预防, 终日提防戒惧. 同时, 认真观察市场的变化, 随时转向, 开拓新市场. </li>
          <li>求名: 个人追求名利的基本条件已经具备. 必须防止因此而变得僵化和保守, 以致功亏一篑, 半途而废. </li>
          <li>外出: 利于出行, 途中需注意安全. </li>
          <li>婚恋: 起初顺利, 只中途会出现挫折. </li>
          <li>决策: 各方面条件都很好, 环境又有利于成长. 但因此反而会使自己满足, 停止前进, 甚至变得颓废, 趋向没落. 一定要不断刻苦努力, 保持谦虚美德, 常怀不安之心, 防止不测事件发生. </li>
        </ul>
      </div>
    </div>
    <div :class="{ disabled: !isDisplay && (guaOrder != 21)  }">
      <h2>火水未济 离上坎下</h2>
      <div class='guaci'>
        未济: 亨, 小狐汔济, 濡其尾, 无攸利. 
      </div>
      <h3>爻辞(周公)</h3>
      <div class='yaoci'>
        <ul>
          <li>初六: 濡其尾, 吝. 
          </li>
          <li>九二: 曳其轮, 贞吉. 
          </li>
          <li>六三: 未济, 征凶, 利涉大川. 
          </li>
          <li>九四: 贞吉, 悔亡, 震用伐鬼方, 三年有赏于大国. 
          </li>
          <li>六五: 贞吉, 无悔, 君子之光, 有孚, 吉. 
          </li>
          <li>上九: 有孚于饮酒, 无咎, 濡其首, 有孚失是. </li>
        </ul>
      </div>
      <div class='tuan'>
        彖曰: 未济, 亨；柔得中也.  小狐汔济, 未出中也.  濡其尾, 无攸利；
        不续终也.  虽不当位, 刚柔应也. 
      </div>
      <h3>卦象(伏羲)</h3>
      <div class='xiang'>
        象曰: 火在水上, 未济；君子以慎辨物居方. 
        濡其尾, 亦不知极也. 
        九二贞吉, 中以行正也. 
        未济征凶, 位不当也. 
        贞吉悔亡, 志行也. 
        君子之光, 其晖吉也. 
        饮酒濡首, 亦不知节也. 
      </div>
      <h3>电脑解卦</h3>
      <div class='computer'>
        <ul>
          <li>象曰: 离地着人几丈深, 是防偷营劫寨人, 后封太岁为凶煞, 时加谨慎祸不侵. </li>
          <li>这个卦是异卦（下坎上离）相叠. 离为火, 坎为水. 火上水下, 火势压倒水势, 救火大功未成, 故称未济. 《周易》以乾坤二卦为始, 以既济、未济二卦为终, 充分反映了变化发展的思想. </li>
          <li>事业: 处于最后的关键时刻, 成功与否就在眼前. 因此务必不可掉以轻心. 自我节制非常重要, 坚持到底, 必要时也可能慎重地进行适度冒险, 以成就事业. </li>
          <li>经商: 市场处于大变动的前夕, 前景如何尚不明显. 这是最为艰苦的时期, 头脑必冷静, 切勿冒险, 不可行动过度, 适度节制, 观察动向, 决定行动. </li>
          <li>求名: 长期的努力和追求即会有结果. 在成败的关键时刻应泰然自若, 听天由命, 顺其自然. </li>
          <li>外出: 积极行动, 十分有利. </li>
          <li>婚恋: 已经渡过了困难阶段, 再慎重地加把劲, 会有美满的结果. </li>
          <li>决策: 此卦的意思是"未完成", 表明前途无量, 有充分发展的可能. 因此, 必须坚持中正的原则, 以明智、中庸、诚信、谦逊的态度, 成就事业. 面对人生, 唯有勤勤恳恳, 极力尽人事, 听天命, 不必过分计较成功与否. </li>
        </ul>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  name: 'ZhouYi',
  data(){
    return {  
      guaOrder: this.$route.query.q,
      isDisplay: !this.$route.query.q
    }
  }
}
</script>
<style scoped>
.guaci {
  font-size: 14pt;
  font-weight: bold;
  color: #FF6600;
  padding-inline-start:1em;
}
.yaoci ul {
  font-size: 14pt;
  font-weight: bold;
  line-height: 25px;
  color: blue;
  list-style:none;
  padding-inline-start:1em;
}
.tuan {
  font-size: 13pt;
  color: #800000;
  font-weight: lighter;
  padding: 0;
  margin: 0 1em;
}
.xiang {
  font-size: 13pt;
  color: #0099FF;
  font-weight: lighter;
  margin: 0 1em;
}
.wenyan {
  font-size: 13pt;
  color: Olive;
  font-weight: lighter;
  margin: 0 1em;
}
.wenyan ul {
  list-style:none;
  padding-inline-start:0em;
}
.kongzi ul {
  font-size: 13pt;
  color: DarkMagenta;
  font-weight: lighter;
  list-style:none;
  padding-inline-start:1em;
}
.computer ul {
  list-style:none;
  padding-inline-start: 1em;
  color: #369;
}
.cite {
  font-size: 13pt;
  color: DimGray;
  font-weight: lighter;
}
.disabled{
  display: none;
}
</style>
