const MongoClient = require('mongodb').MongoClient; const uri = "mongodb+srv://vanabel:4KG8AKrhg6xTmhy@cluster0-drdcq.mongodb.net/zhouyibagua?retryWrites=true";
const client = new MongoClient(uri, { useNewUrlParser: true });
//liuqin={1:'子孙', 2:'妻财', 3:'父母', 4:'官鬼', 5:'兄弟'}
//wuxing={1:'木', 2:'火', 3:'土', 4:'金', 5:'水'}
//tianGan = {1:'甲', 2:'乙', 3:'丙', 4:'丁', 5:'戊', 6:'己', 7:'庚', 8:'辛', 9:'壬',10:'癸'};
//diZhi = {1:'子', 2:'丑', 3:'寅', 4:'卯', 5:'辰', 6:'巳', 7:'午', 8:'未', 9:'申',10:'酉', 11:'戌', 12:'亥'};
//bagua = {1:'乾', 2:'坎', 3:'艮', 4:'震', 5:'巽', 6:'离', 7:'坤', 8:'兑'};
//baguagan = {9:'乾上', 1:'乾下', 5:'坎', 3:'艮', 7:'震', 8:'巽', 6:'离', 2:'坤下', 4:'兑',10:'坤上'};
const bagua = [ 
  63: { gong:'乾', name:'乾为天'  , shi:6, ying:3, liuqin:[1,2,3,4,5,3], gan:[ 1, 1, 1, 9, 9, 9], zhi:[ 1, 3, 5, 7, 9,11], wuxing:[5,1,3,2,4,3] },
  31: { gong:'乾', name:'天风姤'  , shi:1, ying:4, liuqin:[3,1,5,4,5,3], gan:[ 8, 8, 8, 9, 9, 9], zhi:[ 2,12,10, 7, 9,11], wuxing:[3,5,4,2,4,3] },
  15: { gong:'乾', name:'天山遯'  , shi:2, ying:5, liuqin:[3,4,5,4,5,3], gan:[ 3, 3, 3, 9, 9, 9], zhi:[ 5, 7, 9, 7, 9,11], wuxing:[3,2,4,2,4,3] },
   7: { gong:'乾', name:'天地否'  , shi:3, ying:6, liuqin:[3,4,2,4,5,3], gan:[ 2, 2, 2, 9, 9, 9], zhi:[ 8, 6, 4, 7, 9,11], wuxing:[3,2,1,2,4,3] },
   3: { gong:'乾', name:'风地观'  , shi:4, ying:1, liuqin:[3,4,2,3,4,2], gan:[ 2, 2, 2, 8, 8, 8], zhi:[ 8, 6, 4, 8, 6, 4], wuxing:[3,2,1,3,2,1] },
   1: { gong:'乾', name:'山地剥'  , shi:5, ying:2, liuqin:[3,4,2,3,1,2], gan:[ 2, 2, 2, 3, 3, 3], zhi:[ 8, 6, 4,11, 1, 3], wuxing:[3,2,1,3,5,1] },
   5: { gong:'乾', name:'火地晋'  , shi:4, ying:1, liuqin:[3,4,2,5,3,4], gan:[ 2, 2, 2, 6, 6, 6], zhi:[ 8, 6, 4,10, 8, 6], wuxing:[3,2,1,4,3,2] },
  61: { gong:'乾', name:'火天大有', shi:3, ying:6, liuqin:[1,2,3,5,3,4], gan:[ 1, 1, 1, 6, 6, 6], zhi:[ 1, 3, 5,10, 8, 6], wuxing:[5,1,3,4,3,2] },
  18: { gong:'坎', name:'坎为水'  , shi:6, ying:3, liuqin:[1,4,2,3,4,5], gan:[ 5, 5, 5, 5, 5, 5], zhi:[ 3, 5, 7, 9,11, 1], wuxing:[1,3,2,4,3,5]},
  50: { gong:'坎', name:'水泽节'  , shi:1, ying:4, liuqin:[2,1,4,3,4,5], gan:[ 4, 4, 4, 5, 5, 5], zhi:[ 6, 4, 2, 9,11, 1], wuxing:[2,1,3,4,3,5] },
  34: { gong:'坎', name:'水雷屯'  , shi:2, ying:5, liuqin:[5,1,4,3,4,5], gan:[ 7, 7, 7, 5, 5, 5], zhi:[ 1, 3, 5, 9,11, 1], wuxing:[5,1,3,4,3,5] },
  42: { gong:'坎', name:'水火既济', shi:3, ying:6, liuqin:[1,4,5,3,4,5], gan:[ 6, 6, 6, 5, 5, 5], zhi:[ 4, 2,12, 9,11, 1], wuxing:[1,3,5,4,3,5] },
  46: { gong:'坎', name:'泽火革'  , shi:4, ying:1, liuqin:[1,4,5,5,3,4], gan:[ 6, 6, 6, 4, 4, 4], zhi:[ 4, 2,12,12,10, 8], wuxing:[1,3,5,5,4,3] },
  44: { gong:'坎', name:'雷火丰'  , shi:5, ying:2, liuqin:[1,4,5,2,3,4], gan:[ 6, 6, 6, 7, 7, 7], zhi:[ 4, 2,12, 7, 9,11], wuxing:[1,3,5,2,4,3] },
  40: { gong:'坎', name:'地火明夷', shi:4, ying:1, liuqin:[1,4,5,4,5,3], gan:[ 6, 6, 6,10,10,10], zhi:[ 4, 2,12, 2,12,10], wuxing:[1,3,5,3,5,4] },
  16: { gong:'坎', name:'地水师'  , shi:3, ying:6, liuqin:[1,4,2,4,5,3], gan:[ 5, 5, 5,10,10,10], zhi:[ 3, 5, 7, 2,12,10], wuxing:[1,3,2,3,5,4] },
   9: { gong:'艮', name:'艮为山'  , shi:6, ying:3, liuqin:[5,3,1,5,2,4], gan:[ 3, 3, 3, 3, 3, 3], zhi:[ 5, 7, 9,11, 1, 3], wuxing:[3,2,4,3,5,1] },
  41: { gong:'艮', name:'山火贲'  , shi:1, ying:4, liuqin:[4,5,2,5,2,4], gan:[ 6, 6, 6, 3, 3, 3], zhi:[ 4, 2,12,11, 1, 3], wuxing:[1,3,5,3,5,1] },
  57: { gong:'艮', name:'山天大畜', shi:2, ying:5, liuqin:[1,3,5,5,2,4], gan:[ 1, 1, 1, 3, 3, 3], zhi:[ 5, 1, 3,11, 1, 3], wuxing:[5,1,3,3,5,1] },
  49: { gong:'艮', name:'山泽损'  , shi:3, ying:6, liuqin:[3,4,5,5,2,4], gan:[ 4, 4, 4, 3, 3, 3], zhi:[ 6, 4, 2,11, 1, 3], wuxing:[2,1,3,3,5,1] },
  53: { gong:'艮', name:'火泽睽'  , shi:4, ying:1, liuqin:[3,4,5,1,5,3], gan:[ 4, 4, 4, 6, 6, 6], zhi:[ 6, 4, 2,10, 8, 6], wuxing:[2,1,3,4,3,2] },
  55: { gong:'艮', name:'天泽履'  , shi:5, ying:2, liuqin:[3,4,5,3,1,5], gan:[ 4, 4, 4, 9, 9, 9], zhi:[ 6, 4, 2, 7, 9,11], wuxing:[2,1,3,2,4,3] },
  51: { gong:'艮', name:'风泽中孚', shi:4, ying:1, liuqin:[3,4,5,5,3,4], gan:[ 4, 4, 4, 8, 8, 8], zhi:[ 6, 4, 2, 8, 6, 4], wuxing:[2,1,3,3,2,1] },
  11: { gong:'艮', name:'风山渐'  , shi:3, ying:6, liuqin:[5,3,1,5,3,4], gan:[ 3, 3, 3, 8, 8, 8], zhi:[ 5, 7, 9, 8, 6, 4], wuxing:[3,2,4,3,2,1] },
  36: { gong:'震', name:'震为雷'  , shi:6, ying:3, liuqin:[3,5,2,1,4,2], gan:[ 7, 7, 7, 7, 7, 7], zhi:[ 1, 3, 5, 7, 9,11], wuxing:[5,1,3,2,4,3] },
   4: { gong:'震', name:'雷地豫'  , shi:1, ying:4, liuqin:[2,1,5,1,4,2], gan:[ 2, 2, 2, 7, 7, 7], zhi:[ 8, 6, 4, 7, 9,11], wuxing:[3,2,1,2,4,3] },
  20: { gong:'震', name:'雷水解'  , shi:2, ying:5, liuqin:[5,2,1,1,4,2], gan:[ 5, 5, 5, 7, 7, 7], zhi:[ 3, 5, 7, 7, 9,11], wuxing:[1,3,2,2,4,3] },
  28: { gong:'震', name:'雷风恒'  , shi:3, ying:6, liuqin:[2,3,4,1,4,2], gan:[ 4, 4, 4, 7, 7, 7], zhi:[ 2,12,10, 7, 9,11], wuxing:[3,5,4,2,4,3] },
  24: { gong:'震', name:'地风升'  , shi:4, ying:1, liuqin:[2,3,4,2,3,4], gan:[ 4, 4, 4,10,10,10], zhi:[ 2,12,10, 2,12,10], wuxing:[3,5,4,3,5,4] },
  26: { gong:'震', name:'水风井'  , shi:5, ying:2, liuqin:[2,3,4,4,2,3], gan:[ 4, 4, 4, 5, 5, 5], zhi:[ 2,12,10, 9,11, 1], wuxing:[3,5,4,4,3,5] },
  30: { gong:'震', name:'泽风大过', shi:4, ying:1, liuqin:[2,3,4,3,4,2], gan:[ 8, 8, 8, 4, 4, 4], zhi:[ 2,12,10,12,10, 8], wuxing:[3,5,4,5,4,3] },
  38: { gong:'震', name:'泽雷随'  , shi:3, ying:6, liuqin:[3,5,2,3,4,2], gan:[ 7, 7, 7, 4, 4, 4], zhi:[ 1, 3, 5,12,10, 8], wuxing:[5,1,3,5,4,3] },
  27: { gong:'巽', name:'巽为风'  , shi:6, ying:3, liuqin:[2,3,4,2,1,5], gan:[ 8, 8, 8, 8, 8, 8], zhi:[ 2,12,10, 8, 6, 4], wuxing:[3,5,4,3,2,1] },
  59: { gong:'巽', name:'风天小畜', shi:1, ying:4, liuqin:[3,5,2,2,1,5], gan:[ 1, 1, 1, 8, 8, 8], zhi:[ 1, 3, 5, 8, 6, 4], wuxing:[5,1,3,3,2,1] },
  43: { gong:'巽', name:'风火家人', shi:2, ying:5, liuqin:[5,2,3,2,1,5], gan:[ 6, 6, 6, 8, 8, 8], zhi:[ 4, 2,12, 8, 6, 4], wuxing:[1,3,5,3,2,1] },
  35: { gong:'巽', name:'风雷益'  , shi:3, ying:6, liuqin:[3,5,2,2,1,5], gan:[ 7, 7, 7, 8, 8, 8], zhi:[ 1, 3, 5, 8, 6, 4], wuxing:[5,1,3,3,2,1] },
  39: { gong:'巽', name:'天雷无妄', shi:4, ying:1, liuqin:[3,5,2,1,4,2], gan:[ 7, 7, 7, 9, 9, 9], zhi:[ 1, 3, 5, 7, 9,11], wuxing:[5,1,3,2,4,3] },
  37: { gong:'巽', name:'火雷噬嗑', shi:5, ying:2, liuqin:[3,5,2,4,2,1], gan:[ 7, 7, 7, 6, 6, 6], zhi:[ 1, 3, 5,10, 8, 6], wuxing:[5,1,3,4,3,2] },
  33: { gong:'巽', name:'山雷颐'  , shi:4, ying:1, liuqin:[3,5,2,2,3,5], gan:[ 7, 7, 7, 3, 3, 3], zhi:[ 1, 3, 5,11, 1, 3], wuxing:[5,1,3,3,5,1] },
  25: { gong:'巽', name:'山风蛊'  , shi:3, ying:6, liuqin:[2,3,4,2,3,5], gan:[ 8, 8, 8, 3, 3, 3], zhi:[ 2,12,10,11, 1, 3], wuxing:[3,5,4,3,5,1] },
  45: { gong:'离', name:'离为火'  , shi:6, ying:3, liuqin:[3,1,4,2,1,5], gan:[ 6, 6, 6, 6, 6, 6], zhi:[ 4, 2,12,10, 8, 6], wuxing:[1,3,5,4,3,2] },
  13: { gong:'离', name:'火山旅'  , shi:1, ying:4, liuqin:[1,5,2,2,1,5], gan:[ 3, 3, 3, 6, 6, 6], zhi:[ 5, 7, 9,10, 8, 6], wuxing:[3,2,4,4,3,2] },
  29: { gong:'离', name:'火风鼎'  , shi:2, ying:5, liuqin:[1,4,2,2,1,5], gan:[ 8, 8, 8, 6, 6, 6], zhi:[ 2,12,10,10, 8, 6], wuxing:[3,5,4,4,3,2] },
  21: { gong:'离', name:'火水未济', shi:3, ying:6, liuqin:[3,1,5,2,1,5], gan:[ 5, 5, 5, 6, 6, 6], zhi:[ 3, 5, 7,10, 8, 6], wuxing:[1,3,2,4,3,2] },
  17: { gong:'离', name:'山水蒙'  , shi:4, ying:1, liuqin:[3,1,5,1,4,3], gan:[ 5, 5, 5, 3, 3, 3], zhi:[ 3, 5, 7,11, 1, 3], wuxing:[1,3,2,3,5,1] },
  19: { gong:'离', name:'风水涣'  , shi:5, ying:2, liuqin:[3,1,5,1,5,3], gan:[ 5, 5, 5, 8, 8, 8], zhi:[ 3, 5, 7, 8, 6, 4], wuxing:[1,3,2,3,2,1] },
  23: { gong:'离', name:'天水讼'  , shi:4, ying:1, liuqin:[3,1,5,5,2,1], gan:[ 5, 5, 5, 9, 9, 9], zhi:[ 3, 5, 7, 7, 9,11], wuxing:[1,3,2,2,4,3] },
  47: { gong:'离', name:'天火同人', shi:3, ying:6, liuqin:[3,1,4,5,2,1], gan:[ 6, 6, 6, 9, 9, 9], zhi:[ 4, 2,12, 7, 9,11], wuxing:[1,3,5,2,4,3] },
   0: { gong:'坤', name:'坤为地'  , shi:6, ying:3, liuqin:[5,3,4,5,2,1], gan:[ 2, 2, 2,10,10,10], zhi:[ 8, 6, 4, 2,12,10], wuxing:[3,2,1,3,5,4] },
  32: { gong:'坤', name:'地雷复'  , shi:1, ying:4, liuqin:[2,4,5,5,2,1], gan:[ 7, 7, 7,10,10,10], zhi:[ 1, 3, 5, 2,12,10], wuxing:[5,1,3,3,5,4] },
  48: { gong:'坤', name:'地泽临'  , shi:2, ying:5, liuqin:[3,4,5,5,2,1], gan:[ 4, 4, 4,10,10,10], zhi:[ 6, 4, 2, 2,12,10], wuxing:[2,1,3,3,5,4] },
  56: { gong:'坤', name:'地天泰'  , shi:3, ying:6, liuqin:[2,4,5,5,2,1], gan:[ 1, 1, 1,10,10,10], zhi:[ 1, 3, 5, 2,12,10], wuxing:[5,1,3,3,5,4] },
  60: { gong:'坤', name:'雷天大壮', shi:4, ying:1, liuqin:[2,4,5,3,1,5], gan:[ 1, 1, 1, 7, 7, 7], zhi:[ 1, 3, 5, 7, 9,11], wuxing:[5,1,3,2,4,3] },
  62: { gong:'坤', name:'泽天夬'  , shi:5, ying:2, liuqin:[2,4,5,2,1,5], gan:[ 1, 1, 1, 4, 4, 4], zhi:[ 1, 3, 5,12,10, 8], wuxing:[5,1,3,5,4,3] },
  58: { gong:'坤', name:'水天需'  , shi:4, ying:1, liuqin:[2,4,5,1,5,2], gan:[ 1, 1, 1, 5, 5, 5], zhi:[ 1, 3, 5, 9,11, 1], wuxing:[5,1,3,4,3,5] },
   2: { gong:'坤', name:'水地比'  , shi:3, ying:6, liuqin:[5,3,4,1,5,2], gan:[ 2, 2, 2, 5, 5, 5], zhi:[ 8, 6, 4, 9,11, 1], wuxing:[3,2,1,4,3,5] },
  54: { gong:'兑', name:'兑为泽'  , shi:6, ying:3, liuqin:[4,2,3,1,5,3], gan:[ 4, 4, 4, 4, 4, 4], zhi:[ 6, 4, 2,12,10, 8], wuxing:[2,1,3,5,4,3] },
  22: { gong:'兑', name:'泽水困'  , shi:1, ying:4, liuqin:[2,3,4,1,5,3], gan:[ 5, 5, 5, 4, 4, 4], zhi:[ 3, 5, 7,12,10, 8], wuxing:[1,3,2,5,4,3] },
   6: { gong:'兑', name:'泽地萃'  , shi:2, ying:5, liuqin:[3,4,2,1,5,3], gan:[ 2, 2, 2, 4, 4, 4], zhi:[ 8, 6, 4,12,10, 8], wuxing:[3,2,1,5,4,3] },
  14: { gong:'兑', name:'泽山咸'  , shi:3, ying:6, liuqin:[3,4,5,1,5,3], gan:[ 3, 3, 3, 4, 4, 4], zhi:[ 5, 7, 9,12,10, 8], wuxing:[3,2,4,5,4,3] },
  10: { gong:'兑', name:'水山蹇'  , shi:4, ying:1, liuqin:[3,4,5,5,3,1], gan:[ 3, 3, 3, 5, 5, 5], zhi:[ 5, 7, 9, 9,11, 1], wuxing:[3,2,4,4,3,5] },
   8: { gong:'兑', name:'地山谦'  , shi:5, ying:2, liuqin:[3,4,5,3,1,5], gan:[ 3, 3, 3,10,10,10], zhi:[ 5, 7, 9, 2,12,10], wuxing:[3,2,4,3,5,4] },
  12: { gong:'兑', name:'雷山小过', shi:4, ying:1, liuqin:[3,4,5,4,5,3], gan:[ 3, 3, 3, 7, 7, 7], zhi:[ 5, 7, 9, 7, 9,11], wuxing:[3,2,4,2,4,3] },
  52: { gong:'兑', name:'雷泽归妹', shi:3, ying:6, liuqin:[4,2,3,4,5,3], gan:[ 4, 4, 4, 7, 7, 7], zhi:[ 6, 4, 2, 7, 9,11], wuxing:[2,1,3,2,4,3] },
];
client.connect(err => {
  const collection = client.db("zhouyibagua").collection("bagua");
  collection.insertOne(bagua);
  console.log("Database created!");
  client.close();
});
